[
  {
    "date": "May 5",
    "subHeader": "AT A GLANCE",
    "timeline": [{
      "time":  "8:30 am",
      "label": "Gates Open"
    }, {
      "time": "10:00 am",
      "label": "First talk"
    }, {
      "time": "11:45 am",
      "label": "Lunch"
    }, {
      "time": "4:00 pm",
      "label": "Talks end"
    }, {
      "time": "5:30 pm",
      "label": "Offsite Afterparty"
    }]
  },
  {
    "schedule": [
      {
        "time": "8:30 am",
        "speaker": null,
        "company": null,
        "talkTitle": "Breakfast & sponsor exhibits",
        "talkDescription": "Join us for coffee, tea, plus a wide selection of food including frittatas, quiche, fresh fruit, and whole grains! Come and chat with our 15 exciting sponsors who are exhibiting this year. Their booths are staffed by senior software engineers. Come learn about what they’re building, what problems they can solve for you and your team, and maybe even make a new friend!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "10:00 am",
        "speaker": "Anjana Vakil",
        "company": "Observable",
        "talkTitle": "Welcome & Introduction",
        "talkDescription": "Settle in for the welcome address by our Master of Ceremonies, Anjana Vakil",
        "photo": "speakers/speaker-anjana.jpg",
        "speakerBio": "Anjana suffers from a debilitating case of curiosity, which led her from philosophy to English teaching to computational linguistics to software development. She can often be found coding in San Francisco; that is, when she's not speaking at events around the world to share the joy of programming and advocate for a more diverse and inclusive tech industry. Ask her about the Recurse Center, Outreachy, and Mozilla TechSpeakers!",
        "showBioExpands": true
      },
      {
        "time": "10:05 am",
        "speaker": "Simona Cotin",
        "company": "Microsoft Azure",
        "talkTitle": "Keynote",
        "talkDescription": "Abstract coming soon",
        "photo": "speakers/speaker-simona.jpg",
        "speakerBio": "Simona Cotin is a web developer with a passion for teaching. She spends most of her time tinkering with JavaScript in the cloud and sharing her experience with other developers. As a Cloud Developer Advocate, Simona engages with the web community to help create a great developer experience with Azure. She loves shipping code to production and has built network data analytics platforms using Angular, Typescript, React, and Node.js.",
        "showBioExpands": true
      },
      {
        "time": "10:35 am",
        "speaker": "Matt Biilmann, Brian LeRoux, and Jeremy Daly",
        "company": "Netlify, Begin.com, and Serverless.com",
        "talkTitle": "Panel: The future of Jamstack & Serverless",
        "talkDescription": "Abstract coming soon",
        "photo": "speakers/speaker-tbd.jpg",
        "speakerBio": "Matt is CEO of Netlify, Brian is CTO of Begin.com, and Jeremy is GM of Serverless Cloud",
        "showBioExpands": true
      },
      {
        "time": "11:45 - 1:15pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Lunch",
        "talkDescription": "Grab lunch in the upper lounge by the Silver sponsors and grab a seat at one of the picnic tables shaded by the beautiful canopy of trees!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "1:15 pm",
        "speaker": "Farrah Campbell",
        "company": "AWS",
        "talkTitle": "I built a Serverless Backend and you can too",
        "talkDescription": "Using Serverless reduces time spent managing infrastructure and provides developers more time to focus on code. In this session, I will talk about why front end developers should care about serverless and how it gives front end-focused teams the superpower to build a scalable back end for their applications without all the overhead of managing infrastructures. Along the way we will discuss pitfalls and best practices to help you get a jump start on developing without servers.",
        "photo": "speakers/speaker-farrah.jpg",
        "speakerBio": "After 10 years of working in healthcare management, a serendipitous 20-minute car ride with Kara Swisher inspired Farrah to make the jump into technology. She has worked at multiple startups in many different capacities, eventually working her way to being a Sr. Product Marketing Manager at AWS focused on Modern Applications. She is known for not only her ability to get things done but her track-record of accomplishing lofty goals in creative, dynamic ways with an infectious smile. Her passion lies in influencing outcomes and driving projects with multiple stakeholders, priorities, and personalities towards a common goal. She will be the first to tell you how much she loves the chaos and challenges that tech provides. Farrah has shaped a unique story and career that supports her passion for fostering genuine, vibrant communities. She aims to re-define the experience of “providing a service” with a no bs attitude and lots of compassion.",
        "showBioExpands": true
      },
      {
        "time": "1:40 pm",
        "speaker": "Erik Rasmussen",
        "company": "Centered.app",
        "talkTitle": "State Machines on the Edge",
        "talkDescription": "Modeling business logic with state machines has numerous benefits, from eliminating bugs caused by impossible states to visualizing the logic to communicate with non-technical shareholders to simply communicating user flow between technical colleagues. In this talk, I'm going to demonstrate, via live coding, how to combine the strengths of Remix and XState to create a checkout flow entirely on the backend. No. JavaScript. Required.",
        "photo": "speakers/speaker-erik.jpg",
        "speakerBio": "Erik is an American expat in Spain and author of Redux Form and React Final Form. He's currently obsessed with XState, Remix, and building the best productivity app for developers at Centered.",
        "showBioExpands": true
      },
      {
        "time": "2:05 - 2:45pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Break",
        "talkDescription": "Discuss the afternoon's topics with your fellow attendees, speakers, and visit the sponsor booths!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "2:45 pm",
        "speaker": "Rob Sutter",
        "company": "Fauna",
        "talkTitle": "Building data-driven APIs at the edge",
        "talkDescription": "Talk abstract coming soon",
        "photo": "speakers/speaker-rob.jpg",
        "speakerBio": "Rob has woven application development into his entire career, from time in the U.S. Army and U.S. Government to stints with the Big Four and Amazon Web Services. He has started his own company – twice – most recently with WorkFone, a SaaS startup that provided virtual digital identities to government clients. Rob loves to build in public with all things serverless!",
        "showBioExpands": true
      },
      {
        "time": "3:10 pm",
        "speaker": "Kristi Perreault",
        "company": "Liberty Mutual",
        "talkTitle": "What I Have Learned Scaling Serverless First at Liberty Mutual",
        "talkDescription": "Serverless first is a growing initiative, but what exactly does this look like in enterprise? How do we scale serverless for thousands of developers? As a sr software engineer for serverless enablement, I will share my unique perspective on how to get started with a serverless team. I will discuss what worked well for us, including pattern development, our support model, enabling constraints, building a serverless community, and educating our tech leads. We will review what could be improved, including day 2 pattern usage, cloud education & experimentation, resource provisioning, and gaining buy in from tech leaders. Lastly, attendees will get a glimpse of what's to come, and where we're headed next.",
        "photo": "speakers/speaker-kristi.jpg",
        "speakerBio": "Kristi Perreault is a Senior Software Engineer at Liberty Mutual Insurance, where her focus is serverless development and enablement. She has over 4 years of industry experience, holds an M.S. in Electrical & Computer Engineering, and is very passionate about promoting women in technology. Outside of work and the serverless tech space, Kristi can be found in the mountains of Colorado hiking, mountain biking, skiing, golfing, or doing just about anything else outdoors.",
        "showBioExpands": true
      },
      {
        "time": "3:40 - 5:00pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Open networking",
        "talkDescription": "Chat with your fellow attendees & make plans for the offsite afterparty or dinner!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "5:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Doors Close",
        "talkDescription": "That's a wrap! See you at the offiste afterparty!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "5:00 - 8:30pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Offsite Afterparty!",
        "talkDescription": "Join us at the Graduate Berkeley hotel lobby for food, drinks, conversation and networking!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      }
    ]
  }
]
