[
  {
    "date": "Dec 8",
    "subHeader": "AT A GLANCE",
    "timeline": [{
      "time":  "7:30 am",
      "label": "Workshops Start"
    }, {
      "time": "8:30 am",
      "label": "Sponsor Expo"
    }, {
      "time": "9:30 am",
      "label": "Stage Talks"
    }, {
      "time": "11:30 am",
      "label": "Topic Tables"
    }, {
      "time": "2:00 pm",
      "label": "Sponsor Expo"
    }, {
      "time": "3:00 pm",
      "label": "Program Schedule Ends"
    }]
  },
  {
    "schedule": [
      {
        "time": "7:30 - 9:30am",
        "speaker": null,
        "company": null,
        "talkTitle": "Workshops",
        "talkDescription": "Ryan Chenkie: React Security | Erik Rasmussen: Modern Forms in React | Brandon Bayer: Introduction to Blitz.js | And many more to be announced soon!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "8:30 - 9:55am",
        "speaker": null,
        "company": null,
        "talkTitle": "Sponsor Expo",
        "talkDescription": "Come learn from and hang out with the engineers at our sponsor companies!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "10:00 am",
        "speaker": "Anjana Vakil",
        "company": "Observable",
        "talkTitle": "Welcome & Introduction",
        "talkDescription": "Settle in for the welcome address by our Master of Ceremonies, Anjana Vakil",
        "photo": "speakers/speaker-anjana.jpg",
        "speakerBio": "Anjana suffers from a debilitating case of curiosity, which led her from philosophy to English teaching to computational linguistics to software development. She can often be found coding in San Francisco; that is, when she's not speaking at events around the world to share the joy of programming and advocate for a more diverse and inclusive tech industry. Ask her about the Recurse Center, Outreachy, and Mozilla TechSpeakers!",
        "showBioExpands": true
      },
      {
        "time": "10:05 am",
        "speaker": "Kent C. Dodds",
        "company": "KentCDodds.com",
        "talkTitle": "Keynote: Managing React Application State Management",
        "talkDescription": "Application State Management is one of the hardest parts of building and maintaining React Applications. The number of options you have is numerous and the reason is that it's just such a hard problem with so many nuances and trade-offs. One thing that makes application state management harder is when we aren't thoughtful about how that state is organized and categorized in our app. There are different kinds of state and they require different approaches for management. When you try to treat all app state exactly the same is when problems come into play. Let's talk about what some of those categories are and how we can drastically simplify our application code and improve our app's performance by thinking about and organizing our state differently.",
        "photo": "speakers/speaker-kent.jpg",
        "speakerBio": "Kent C. Dodds is a world-renowned speaker, teacher, and trainer who is actively involved in the open source community as a maintainer and contributor of hundreds of popular npm packages. Kent is the creator of TestingJavaScript.com, and he's an instructor on egghead.io and Frontend Masters. He's also a Google Developer Expert. Kent is happily married and the father of four kids. He likes his family, code, JavaScript, and React.",
        "showBioExpands": false
      },
      {
        "time": "10:40 am",
        "speaker": "Tejas Kumar",
        "company": "G2i",
        "talkTitle": "Inside React: A Deeper Look",
        "talkDescription": "We spend a lot of time using React as a component abstraction layer on the DOM. This talk peeks under the surface as we explore together what makes React, React.",
        "photo": "speakers/speaker-tejas.jpg",
        "speakerBio": "Tejas has been programming since age 8. From vanilla JavaScript, through popular JavaScript libraries like jQuery, scriptaculous and mootools, through React. He has built large, profitable React applications over his tenure for a number of establishments, as well as open source design systems and data-related libraries. Tejas believes the component model of React, in addition to high developer sensitivity from the core team is what has led to React's dominance of the modern web platform.",
        "showBioExpands": true
      },
      {
        "time": "11:05 am",
        "speaker": "Daria Caraway",
        "company": "Workday",
        "talkTitle": "Building Considerate React Component APIs with TypeScript",
        "talkDescription": "TypeScript is often praised for adding a layer of bug protection on top of JavaScript applications. But, how can we also use TypeScript to improve the readability of our React component interfaces for our fellow team members? Just because types compile, doesn’t mean they are helping to document and describe our code for our future selves and others. Perhaps we can shift our perspective about TypeScript from a bug catching tool to a developer experience tool that enables us to write reasonable and intuitive code interfaces. In this talk, you will learn how to think like a consumer and take advantage of basic and advanced TypeScript types to enhance the readability of your React component APIs.",
        "photo": "speakers/speaker-daria.jpg",
        "speakerBio": "Daria is a Speaker, Certified Scrum Master and Software Engineer at Workday where she builds consumer grade experiences for the enterprise user. Daria currently resides in her hometown of Boulder, Colorado where she will often be found at the rock climbing gym or hanging out with her cat, Odin.",
        "showBioExpands": true
      },
      {
        "time": "11:30 am - 1:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Topic Tables",
        "talkDescription": "Ken Wheeler: Performance in React | Naomi Meyer: Internationalization | Muhsin Abdul-Musawwir: Testing | Vladimir Novick: React Native | Eve Porcello: GraphQL | Erik Rasmussen: Forms in React | Mark Erikson: Redux | Kent C. Dodds: Suspense | Daria Caraway: TypeScript | Brandon Bayer: Blitz.js | Ben Lesh: RxJS",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "1:00 pm",
        "speaker": "Naomi Meyer",
        "company": "Adobe",
        "talkTitle": "Building React Apps with Internationalization (I18N) in Mind",
        "talkDescription": "At Adobe we build products for the world, this talk with provide a high level overview of internationalization (I18N), localization (L10N), and globalization (G11N) best practices - specifically within a React context. We'll go over why these are important and how best to implement in design, UX, and within the codebase - using React examples as well as React and JavaScript tool recommendations.",
        "photo": "speakers/speaker-naomi.jpg",
        "speakerBio": "Naomi works as a Software Development Engineer at Adobe in New York City, where she is the product champion for internationalization (i18n) on her team. Before writing JavaScript full time, Naomi worked teaching English as a foreign language in local classrooms across Asia and West Africa. She is passionate about developing with diversity, inclusion, and internationalization (i18n) in mind, and enjoys hiking and riding bikes on the weekends.",
        "showBioExpands": true
      },
      {
        "time": "1:30 pm",
        "speaker": "David Khourshid",
        "company": "Microsoft",
        "talkTitle": "State: The Next (Auto-)Generation",
        "talkDescription": "Diagrams, user stories, tests, documentation. If you just sighed, you're one of many developers who know the hardships of keeping these vital parts of software in sync with the apps you develop. But what if there was a way to autogenerate these? Enter model-driven development. In this talk, we'll explore how state machines and statecharts can be used to model even the most complex logic and automatically visualize, generate tests, produce documentation, and more. Learn how to leverage models, save time, and ship faster, more robust React apps.",
        "photo": "speakers/speaker-david.jpg",
        "speakerBio": "David Khourshid (known on Twitter as David K. Piano) is a software engineer for Microsoft, a tech author, and speaker. Also a fervent open-source contributor, he is passionate about statecharts and software modeling, reactive animations, innovative user interfaces, and cutting-edge front-end technologies. When not behind a computer keyboard, he’s behind a piano keyboard or traveling.",
        "showBioExpands": true
      },
      {
        "time": "2:00 - 3:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Sponsor Expo",
        "talkDescription": "Come learn from and hang out with the engineers at our sponsor companies!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "3:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "End of Day 2",
        "talkDescription": "That's the end of the official program schedule! Feel free to stick around to mingle & network with other attendees!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      }
    ]
  }
]
