[
  {
    "date": "May 3",
    "subHeader": "AT A GLANCE",
    "timeline": [{
      "time":  "9:00 am",
      "label": "Workshops Start"
    }, {
      "time": "3:00 pm",
      "label": "Unconference Icebreakers"
    }, {
      "time": "4:00 pm",
      "label": "Doors Open; Sponsor Exhibits"
    }, {
      "time": "6:00 pm",
      "label": "Keynote & Stage Talks"
    }, {
      "time": "7:30 pm",
      "label": "Topic Tables"
    }, {
      "time": "9:00 pm",
      "label": "End of Day 1"
    }]
  },
  {
    "schedule": [
      {
        "time": "9:00am - 4:00pm",
        "speaker": "Swizec Teller",
        "company": "Tia",
        "talkTitle": "In-person workshop",
        "talkDescription": "Learn to forge a senior engineering mindset with Swizec Teller. In-person at the Graduate Berkeley Hotel!",
        "photo": "speaker-swizec",
        "speakerBio": "Swizec is a software engineer, author, educator, and conference speaker. He's published books on modern web technologies, data visualization, and productivity, and has trained engineering teams at Fortune500 companies. Now he's distilling 20 years of tacit experience into actionable steps.",
        "showBioExpands": true
      },
      {
        "time": "3:00pm - 4:00pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Unconference Icebreakers & Covid testing",
        "talkDescription": "It's been a long time since we've met in person. Come to the venue early to chat about life, struggles, wins, losses, anxiety, and other human subjects. Let's empathize with & support one another! If you need to get tested, we suggest you arrive between 2:00 - 3:00pm.",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "4:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "General Admission opens + sponsor exhibits",
        "talkDescription": "We have 15 exciting sponsors exhibiting this year. Their booths are staffed by senior software engineers. Come learn about what they’re building, what problems they can solve for you and your team, and maybe even make a new friend!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "6:00 pm",
        "speaker": "Anjana Vakil",
        "company": "Hasura",
        "talkTitle": "Welcome & Introduction",
        "talkDescription": null,
        "photo": "speakers/speaker-anjana.jpg",
        "speakerBio": "Anjana suffers from a chronic case of curiosity, which led her from philosophy to English teaching to computational linguistics to software development. As a senior developer advocate at Hasura, these days she codes from her home base in San Francisco; in the before-times, you could find her speaking at events around the world. She loves to share the joy of programming and advocate for a more diverse, equitable, and ethical tech industry. Ask her about the Recurse Center & Outreachy, she’s an alumna of both!",
        "showBioExpands": true
      },
      {
        "time": "6:05 pm",
        "speaker": "Lee Robinson",
        "company": "Vercel",
        "talkTitle": "Keynote Part 1: State of React",
        "talkDescription": "React has been evolving with the Web. Learn where React is at today, where it’s headed, and why you should be excited about how the future of React enables you to build better web experiences.",
        "photo": "speakers/speaker-lee.jpg",
        "speakerBio": "Lee Robinson is the Director of Developer Relations at Vercel, where he helps developers build a faster web and leads the Next.js community. Prior to that, Lee was a Senior Software Engineer focused on the frontend. An educator, writer, and speaker, Lee has also created extensive courses on React and Next.js.",
        "showBioExpands": true
      },
      {
        "time": "6:25 pm",
        "speaker": "Kent C. Dodds",
        "company": "Remix",
        "talkTitle": "Keynote Part 2: Shipping to the Edge",
        "talkDescription": "The landscape of the web has evolved drastically since the first website was published to the World Wide Web in 1991. Over the years, the pendulum has swung from servers rendering HTML to JavaScript-heavy clients and now it's swinging toward something more in the middle.What about the web today is enabling us to overcome the shortcomings of the web of the past? In this talk, we'll get a little peak into the history of each of these stages of the web and what that means for anyone building on the web platform in the future.",
        "photo": "speakers/speaker-kent.jpg",
        "speakerBio": "Kent C. Dodds is a world renowned speaker, teacher, and trainer and he's actively involved in the open source community as a maintainer and contributor of hundreds of popular npm packages. Kent is a Co-Founder and Director of Developer Experience at Remix. He is the creator of EpicReact.Dev and TestingJavaScript.com. He's an instructor on egghead.io and Frontend Masters. He's also a Google Developer Expert. Kent is happily married and the father of four kids. He likes his family, code, JavaScript, and React.",
        "showBioExpands": true
      },
      {
        "time": "6:45 pm",
        "speaker": "Lydia Hallie",
        "company": "Vercel",
        "talkTitle": "Advanced Rendering Patterns",
        "talkDescription": "As modern applications are getting more and more complex, it's quite easy to end up with large bundle sizes and long loading times. Although there are many tools that can help with performance, there's still a lot you can do as a developer to load your code more efficiently.  Fortunately, with the help of modern rendering patterns, we can reduce complexity, bundle sizes, and reduce loading times. In this talk, you'll learn about the implementation and use cases of modern rendering patterns including SSR, (on-demand) ISR, Streaming SSR, React Server Components, Progressive Rehydration, and Selective Rehydration.",
        "photo": "speakers/speaker-lydia.jpg",
        "speakerBio": "Lydia Hallie is a Staff Developer Advocate at Vercel primarily focusing on web performance, React, Node, GraphQL, and serverless technologies. She also spends her time mentoring and doing in-person training sessions.",
        "showBioExpands": true
      },
      {
        "time": "7:05 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Secret Presentation",
        "talkDescription": "World premier of a secret project we've been working on!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "7:20 - 9:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Topic Tables",
        "talkDescription": "Come chat with speakers, open source maintainers & core contributors, and other attendees at the topic tables! Loosen up with a drink or stay sharp and sober as you mingle with speakers, sponsors, & fellow attendees!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "9:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "End of Day 1",
        "talkDescription": null,
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      }
    ]
  }
]
