[
  {
    "date": "May 3",
    "subHeader": "AT A GLANCE",
    "timeline": [{
      "time":  "9:00 am",
      "label": "Venue Doors Open"
    }, {
      "time": "10:00 am",
      "label": "First talk"
    }, {
      "time": "12:50 pm",
      "label": "Lunch"
    }, {
      "time": "4:00 pm",
      "label": "Talks end"
    }, {
      "time": "5:00 pm",
      "label": "Offsite Afterparty"
    }]
  },
  {
    "schedule": [
      {
        "time": "9:00am",
        "speaker": null,
        "company": null,
        "talkTitle": "Venue Doors open",
        "talkDescription": "Mingle with other attendees & chat with the sponsors over breakfast & coffee!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "10:00am - 10:05am",
        "speaker": null,
        "company": null,
        "talkTitle": "Welcome & introduction",
        "talkDescription": null,
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "10:05am - 10:30am",
        "speaker": "Wes Bos",
        "company": "WesBos.com & Syntax.fm",
        "talkTitle": "Next-Gen Server JavaScript: Web Standards",
        "talkDescription": "What the heck is the Edge? Why did the creator of Node.js make Deno? Heard of Bun? Why can't you use some Node.js APIs in Cloudflare workers? There are more serverside JavaScript runtimes than browser engines! This talk will dive into each of them, and how we can use them to render, stream, intercept and distribute our applications. More importantly, we review web standards and joint efforts that will help us write applications that can deployed multiple platforms. Ideally, you'll come out of this talk excited about new possibilities and not muttering something about IE6 all over again.",
        "photo": "speakers/speaker-wes.jpg",
        "speakerBio": "Wes is a prolific educator, conference speaker, workshop instructor, and co-host of the popular Syntax.fm podcast. He loves creating educational courses on web development. He lives and works in Hamilton, Canada.",
        "showBioExpands": true
      },
      {
        "time": "10:30am - 10:52am",
        "speaker": "Ankita Kulkarni",
        "company": "kulkarniankita.com",
        "talkTitle": "Unlocking the Mystery of React's Re-Rendering",
        "talkDescription": "Your users will not care what tech you used but how fast your app loads. Have you used a hot new stack that everyone loves but still don’t know how to make it performant? Well, it’s because we think about performance as a after-thought after it becomes a bottleneck and when our infra gets costly, ouch! But there is a way to solve this, introducing Core React. We won’t be introducing new tools but going back to how we need to tell React what the DOM should look like. In this talk, we will finally understand why useCallback and useMemo are used, why Lighthouse doesn’t represent performance, how we can minimize component re-render, why it re-renders? and lastly how to profile it with React devtools.",
        "photo": "speakers/speaker-ankita.jpg",
        "speakerBio": "Ankita is an Educator and teaches courses online or sells digital products, such as her Next.js course or her course program on transforming devs into engineering leads. She has taught over 10,000 students online. Ankita has architected and scaled many web and mobile apps for clients using React, GraphQL, React Native and Next.js. She also shares weekly Leadership and Frontend Snacks in her Newsletter at http://bit.ly/42eCi7k.",
        "showBioExpands": true
      },
      {
        "time": "10:52am - 11:07am",
        "speaker": "Andre Landgraf",
        "company": "LinkedIn",
        "talkTitle": "The time to go full stack is now",
        "talkDescription": "Do you currently feel stuck working on a React SPA? Is the performance declining? Then it's time to sit down with the decision-makers at your company and convince them to unlock the full potential of the web platform. It is 2023, and the JavaScript ecosystem has never been stronger. In this talk, I want to make 7 points to convince your boss to go full stack. Only with access to the full stack of the web platform will you be able to tackle the performance requirements of tomorrow. You might have already fallen in love with the idea of owning the backend of the web platform, but you will need a business case with solid business incentives to make your boss pay attention. Let’s build one together!",
        "photo": "speakers/speaker-andre.jpg",
        "speakerBio": "Andre is a developer from Germany who is passionate about all things web. He previously worked on voice apps at Mercedes-Benz R&D before joining LinkedIn. In his free time, he tutors aspiring developers in weekly meetups and writes about full-stack development.",
        "showBioExpands": true
      },
      {
        "time": "11:07am - 11:47am",
        "speaker": null,
        "company": null,
        "talkTitle": "BREAK",
        "talkDescription": "Discuss the morning's topics with your fellow attendees, speakers, and visit the sponsor booths!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "11:47am - 12:09pm",
        "speaker": "Simon Sturmer",
        "company": "Huddlefire",
        "talkTitle": "The long-tail of type safety",
        "talkDescription": "So you've added TypeScript to your codebase, tweaked your tsconfig file and you're flying high with the confidence of no more runtime exceptions and the joy of being able to confidently refactor your code, right? I've been there, it's a great feeling. But as you soon discover, adding TS to your code is only the first step of true end-to-end type safety. In fact, it's likely the easiest step. What about API calls, databases, parsed JSON, query string parameters, request and response bodies, session storage and all those third party libraries and SDKs? These are the I/O boundaries of your application and they can destroy your otherwise flawless type safety. In this talk I'll walk you through the long tail of type safety, approaches to implementing type-safety in the overlooked areas of your stack, and tools to help you do so. You'll come away from this talk well equipped to make your codebase more robust and resilient to runtime exceptions. And best of all you'll get that sweet TypeScript confidence back again!",
        "photo": "speakers/speaker-simon.jpg",
        "speakerBio": "Simon is a YC Founder, software engineer, speaker and educator. He's been a frontend engineer at Facebook, worked on product infrastructure at YouTube and is an instructor for Pluralsight Enterprise Learning.",
        "showBioExpands": true
      },
      {
        "time": "12:09pm - 12:49pm",
        "speaker": "Nicole Sullivan",
        "company": "Google",
        "talkTitle": "Talk title coming soon",
        "talkDescription": "Abstract coming soon",
        "photo": "speakers/speaker-nicole.jpg",
        "speakerBio": "Bio coming coon",
        "showBioExpands": true
      },
      {
        "time": "12:49pm - 2:49pm",
        "speaker": null,
        "company": null,
        "talkTitle": "LUNCH",
        "talkDescription": "Enjoy an extended lunch to discuss the morning's topics and connect with your fellow attendees! Take your prepaid credit card out to one of the many restaurants within walking distance and keep the productive discussion going!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "2:49pm - 3:11pm",
        "speaker": "Sunil Pai",
        "company": "Cool Computer Club",
        "talkTitle": "Talk title coming soon",
        "talkDescription": "Abstract coming soon",
        "photo": "speakers/speaker-sunil.jpg",
        "speakerBio": "Sunil builds developer tools for ambitious applications at Cool Computer Club. He's previously been on the React team, worked at companies like Meta, Cloudflare, JP Morgan, Flipkart, and is known for open source libraries like glamor. He can be found playing a blue Les Paul or swimming the neighbourhood pond in London.",
        "showBioExpands": true
      },
      {
        "time": "3:11pm - 3:36pm",
        "speaker": "David Khourshid",
        "company": "Stately",
        "talkTitle": "Making state management intelligent",
        "talkDescription": "Managing state is complicated. Humans are even more complicated. As developers, it's our job to deliver seamless and intuitive user experiences, but the sheer complexity of human behavior and the real world can make this a daunting task. In this talk, we'll explore a radical new approach to app development where language models (LLMs) and reinforcement learning (RL) can be used to handle app logic in a more intelligent and human-centric way. We're bringing artificial intelligence to state management in ways that go much, much further than calling the ChatGPT API. You will learn how you can leverage AI in your existing code to create the best UX possible, and peer into the future of AI and the path to AGI.",
        "photo": "speakers/speaker-david.jpg",
        "speakerBio": "David is a software engineer who loves playing piano and is passionate about animations, state machines, cutting-edge user interfaces, and open-source. Previously at Microsoft, he is now the founder of Stately, a startup focused on making even the most complex application logic visual and accessible to developers and non-developers alike.",
        "showBioExpands": true
      },
      {
        "time": "3:36pm - 4:06pm",
        "speaker": "Christoph Nakazawa",
        "company": "Stripe",
        "talkTitle": "Game Development with React & the DOM",
        "talkDescription": "Do easy solutions come at the expense of high performance? In this talk, we'll explore this question as I build a video game from the ground up with JavaScript & React. Along this journey, you'll gain valuable insights into rapid prototyping, test infrastructure, and a range of CSS tricks that can be applied to both game development and your day-to-day work. And perhaps it may even rekindle a love for creating something meaningful & fulfilling, as it did for me!",
        "photo": "speakers/speaker-christoph.jpg",
        "speakerBio": "Christoph is an experienced engineering manager, frontend lead and aspiring game developer. He has played a key role in the development of tools such as Jest, React Native, Metro, and Yarn while working at companies like Facebook and Stripe. Currently Christoph is exploring game development and optimizing his workflows and is excited to share more in 2023.",
        "showBioExpands": true
      },
      {
        "time": "4:06pm - 5:30pm",
        "speaker": null,
        "company": null,
        "talkTitle": "DISCUSSION BREAKOUTS",
        "talkDescription": "Enjoy facilitated breakout sessions with speakers, maintainers, core-contributors, and your fellow attendees!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "5:30pm - 9:00pm",
        "speaker": null,
        "company": null,
        "talkTitle": "AFTERPARTY",
        "talkDescription": null,
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      }
    ]
  }
]
