[
  {
    "date": "May 2",
    "subHeader": "AT A GLANCE",
    "timeline": [{
      "time":  "9:00 am",
      "label": "Workshops Start"
    }, {
      "time": "10:00 am",
      "label": "Early Registration @hotel"
    }, {
      "time": "4:00 pm",
      "label": "Venue Doors Open; Sponsor Exhibits"
    }, {
      "time": "5:30 pm",
      "label": "Keynote & Stage Talks"
    }, {
      "time": "8:30 pm",
      "label": "Topic Tables"
    }, {
      "time": "10:30 pm",
      "label": "End of Day 1"
    }]
  },
  {
    "schedule": [
      {
        "time": "10:00am - 2:00pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Early registration at Hotel Kabuki",
        "talkDescription": "Complete your registration early to skip the line at the venue! Look for the tables in the hotel lobby. Be sure to have your Tito ticket QR code at the ready! Connect with your fellow attendees on Slack (or in the lobby) for breakfast and lunch!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "4:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Venue doors open",
        "talkDescription": "On-site registration. Beverages and light food service offered",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "5:30pm - 5:35pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Welcome & Introduction",
        "talkDescription": null,
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "5:35pm - 6:00pm",
        "speaker": "Theo Browne",
        "company": "Ping.gg",
        "talkTitle": "Keynote: The future of React is Us",
        "talkDescription": "From components to JSX to hooks, React has been a beacon of innovation for the web dev world. It didn’t start that way though. When we first saw React’s abstractions in 2012, we were horrified. We eventually were convinced. Now, the roles have reversed. Gatsby, Next and Remix all showed the need for React on the server. It took a bit, but the React team caught on. For the last decade, the community has adopted React’s innovative patterns. This time is different. The innovation of Server Components didn’t come from React. It came from us. In this talk, I’ll be discussing our responsibilities as the new shepherds of React, the React community itself.",
        "photo": "speakers/speaker-theo.jpg",
        "speakerBio": "Theo is a strange mix of full stack dev, youtuber, shitposter and CEO. After helping Twitch migrate to React and TypeScript, he started ping.gg. He's known for creating the T3 Stack and pushing the limits of typesafety",
        "showBioExpands": true
      },
      {
        "time": "6:00pm - 6:20pm",
        "speaker": "Colin Sidoti",
        "company": "Clerk",
        "talkTitle": "Keynote pt 2: A <Component/> is worth a thousand APIs",
        "talkDescription": "After a decade of REST APIs, developer tools have evolved to speak a new language: React Components. From Next.js's <Image/> to Clerk's <SignIn/>, components have rewritten the rulebook for how much power can be packed into a single line of code. They bundle a frontend with an API, and offer a ridiculously fast, 'lego block' integration experience. But what makes a good component? There is no REST convention to follow, and publishers have landed on dramatically fragmented solutions to challenges like styling, routing, and composability. In this talk, we'll explore the rise of components as the ideal developer tool, and unpack the tradeoffs among these fragmented approaches.",
        "photo": "speakers/speaker-colin.jpg",
        "speakerBio": "Colin is co-founder of Clerk, where he helps build authentication and user management tools for React. He has 15 years of frontend experience and is obsessed with making frontend developers more autonomous.",
        "showBioExpands": true
      },
      {
        "time": "6:20pm - 6:40pm",
        "speaker": "Shaundai Person",
        "company": "Netflix",
        "talkTitle": "Splitting the Work: Streaming Server Rendering with Suspense",
        "talkDescription": "Many React developers use server rendering to improve performance.  Before React 18, however, all four (4) steps in the server rendering process (data fetching, rendering to HTML, loading JavaScript, and hydrating) had to be completed for the entire app at once.  This meant that a bigger or more complex part of your app would block other parts from moving onto the next step, making your app appear slower.  Thanks to optimizations in React 18, you can use Suspense to break your app into smaller parts that go through these steps independently.  Users benefit from an app that they can see sooner and interact with almost instantaneously!",
        "photo": "speakers/speaker-shaundai.jpg",
        "speakerBio": "Shaundai is a Senior Software Engineer (Netflix) and TC39 Delegate based in Atlanta, GA, US.  She is passionate about making programming interesting and approachable for all, and does that through her work as a course instructor (tsforjs.com), co-lead for React Robins (reactrobins.com), and technical blogger. In her spare time, Shaundai loves to go hiking, jogging, and listen to audiobooks. Find her on Twitter at @shaundai.",
        "showBioExpands": true
      },
      {
        "time": "6:40pm - 7:20pm",
        "speaker": null,
        "company": null,
        "talkTitle": "BREAK",
        "talkDescription": "Discuss the first session's topics with your fellow attendees, speakers, and visit the sponsor booths! Additional food service & beverages provided.",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "7:20pm - 7:42pm",
        "speaker": "Jeff Escalante",
        "company": "Independent",
        "talkTitle": "The Costs & Benefits of React Server Components",
        "talkDescription": "React server components (RSC) were initially announced in 2020 and finally made broadly available as a beta via next.js a few months ago. There has been talk and hype around them for years, but genuine understanding of what they are, how they work, and where they shine vs struggle is in short supply. In this talk from the former engineering manager of the next.js team, we'll go into depth on RSC from a balanced perspective, and together we will build a solid understanding of when RSC is the right tool to solve the problems you're facing, and when to look elsewhere. We'll also work through practical examples of RSC in action, and take steps towards shifting your perspective into understanding the new architecture model that RSC sits on top of.",
        "photo": "speakers/speaker-jeff.jpg",
        "speakerBio": "Jeff builds web-tooling-oriented software and manages engineering teams doing the same sort of things. Most recently, he was the manager for the next.js team and for part of the react core team at Vercel, and before that led web development at HashiCorp. Outside of work, he runs a small bagel shop and enjoys woodworking, fitness, and playing music.",
        "showBioExpands": true
      },
      {
        "time": "7:42pm - 8:27pm",
        "speaker": "Shruti Kapoor, Ryan Carniato, Fred Schott, Tanner Linsley",
        "company": null,
        "talkTitle": "Panel: Server Component Solutions from the community",
        "talkDescription": "This panel will explore the community-driven solutions on server components. Shruti Kapoor will sit down with Tanner Linsley from the Tanstack, Fred Schott from Astro, and Ryan Carniato from Solid.js to discuss their approaches to server components. Topics covered may include: When & how do these library maintainers integrate, or recommend, server-side rendering in their architectural framing? How does it differ from the React core team's approach, and what does that tell us? What is their long-term vision and/or plan for server components? Footguns, latest innovations, lessons learned from the past and from each other, etc. ",
        "photo": "speakers/speaker-panel.jpg",
        "speakerBio": "Shruti Kapoor is an accomplished React engineer & lead engineer at Slack. Fred Schott is the co-founder & CEO of Astro. Ryan Carniato is the creator of Solid.js and works on the project via Netlify. Tanner Linsley is the founder of Nozzle.io and the creator of many popular libraries including Tanstack Query (formerly React Query), Tanstack Router, and more.",
        "showBioExpands": true
      },
      {
        "time": "8:27pm - 10:27pm",
        "speaker": null,
        "company": null,
        "talkTitle": "TOPIC TABLES",
        "talkDescription": "Come chat with speakers, open source maintainers & core contributors, and other attendees at the topic tables! Loosen up with a drink or stay sharp and sober as you mingle with speakers, sponsors, & fellow attendees!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      }
    ]
  }
]
