[
  {
    "date": "Dec 9",
    "subHeader": "AT A GLANCE",
    "timeline": [{
      "time":  "7:30 am",
      "label": "Workshops Start"
    }, {
      "time": "8:30 am",
      "label": "Sponsor Expo"
    }, {
      "time": "9:30 am",
      "label": "Stage Talks"
    }, {
      "time": "11:00 am",
      "label": "Topic Tables"
    }, {
      "time": "2:00 pm",
      "label": "Sponsor Expo"
    }, {
      "time": "3:00 pm",
      "label": "Program Schedule Ends"
    }]
  },
  {
    "schedule": [
      {
        "time": "7:30 - 9:30am",
        "speaker": null,
        "company": null,
        "talkTitle": "Workshops",
        "talkDescription": "Eve Porcello: GraphQL for React Developers | Mark Erikson: Modern Redux with Redux Toolkit | And many more to be announced soon!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "8:30 - 9:55am",
        "speaker": null,
        "company": null,
        "talkTitle": "Sponsor Expo",
        "talkDescription": "Come learn from and hang out with the engineers at our sponsor companies!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "10:00 am",
        "speaker": "Anjana Vakil",
        "company": "Observable",
        "talkTitle": "Welcome & Introduction",
        "talkDescription": "Settle in for the welcome address by our Master of Ceremonies, Anjana Vakil",
        "photo": "speakers/speaker-anjana.jpg",
        "speakerBio": "Anjana suffers from a debilitating case of curiosity, which led her from philosophy to English teaching to computational linguistics to software development. She can often be found coding in San Francisco; that is, when she's not speaking at events around the world to share the joy of programming and advocate for a more diverse and inclusive tech industry. Ask her about the Recurse Center, Outreachy, and Mozilla TechSpeakers!",
        "showBioExpands": true
      },
      {
        "time": "10:05 am",
        "speaker": "Becca Bailey",
        "company": "Formidable",
        "talkTitle": "Konmari Your Code: Finding Joy in Refactoring",
        "talkDescription": "There’s something deeply satisfying about refactoring React components. Refactoring can help us to simplify, create a foundation for the future, and better communicate our intentions for our codebase. But nothing kills your joy like unintentional changes to existing logic! This talk shares some tips and tricks for stress-free refactoring, like aiming for simplification of logic over premature abstraction, and testing behavior without getting bogged down in implementation details. With a little bit of time and intentionality, we can keep the code that brings us joy and refactor all the rest.",
        "photo": "speakers/speaker-becca.jpg",
        "speakerBio": "Becca is a Frontend Engineer at Formidable with a deep love of React, Typescript, and GraphQL. After a previous career as an elementary music and fine arts teacher, she loves helping artists and career-changers understand software.",
        "showBioExpands": true
      },
      {
        "time": "10:30 am",
        "speaker": "Lee Robinson",
        "company": "Vercel",
        "talkTitle": "Data Fetching with Next.js",
        "talkDescription": "Next.js is a hybrid React framework allowing you to choose your data fetching strategy on a per-page basis. In this talk, you’ll learn more about CSR (Client-Side Rendering), SSR (Server-Side Rendering), SSG (Static-Site Generation), ISR (Incremental Static Regeneration), and when to use each one. I’ll also give a quick introduction to Next.js and share some of the main features of the framework.",
        "photo": "speakers/speaker-leerob.jpg",
        "speakerBio": "Lee is a developer, writer, and course creator. He currently works at Vercel as a Solutions Architect helping educate and grow the Next.js community. He frequently speaks about front-end development, design, and the future of the web.",
        "showBioExpands": true
      },
      {
        "time": "10:50 am",
        "speaker": "Brian Leroux",
        "company": "Begin.com",
        "talkTitle": "Let's put Deno into production",
        "talkDescription": "Deno is a brand new JavaScript runtime from the creator of Node with many compelling characteristics. We can anticipate many folks will be trialing Deno in 2020 whenever it hits the 1.0 milestone. Lambda makes it easy to spin up a custom runtime behind the hyperscale serverless infrastructure of AWS. Combined these ideas are recklessly powerful. A pre-1.0 JavaScript runtime running on the cloud at first appears to be an inadvisable idea. The ecosystem is young! APIs will probably change! On the other hand, Lambda custom runtimes are isolated stateless execution environments that marshall JSON strings. Deno is based on V8 which is a very battle hardened tool for dealing with JSON strings. And the Deno standard library while subject to change before 1.0 is quite stable for most common tasks.  In this talk we go deep into Deno. We’ll deploy a serverless backend to AWS with Deno and compare it directly to Node. How it works, what sets it apart from Node, what sorts of programs it is currently suitable for and where it is likely to go.",
        "photo": "speakers/speaker-brian.jpg",
        "speakerBio": "Brian is the co-founder and CTO of Begin.com, a platform for building and deploying modern web apps, sites, and APIs. He's the creator and maintainer of Architect, an open-source serverless platform that provides everything you need to build fast, modern, massively scalable cloud apps with low code, clear and terse config, and zero ceremony. Ages ago he was the creator of PhoneGap, considered to be the spiritual predecessor of React Native. He spends his time with his wife between Vancouver and San Francisco.",
        "showBioExpands": true
      },
      {
        "time": "11:00 am - 1:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Topic Tables",
        "talkDescription": "JJ Kasper: Next.js | Matt McClure: Web Media | Brian LeRoux: Serverless | Ryan Burgess: Engineering Management | and many more!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "1:05 pm",
        "speaker": "Cassidy Williams",
        "company": "Netlify",
        "talkTitle": "The Future is Now: Building Sci-Fi-Inspired User Interfaces",
        "talkDescription": "Chances are at some point in your life, you've seen some fun sci-fi movie where there's this glorious futuristic user interface. They're full of beautiful colors and graphs and glowy stuff, and they're just generally cooler than what we have now. Someday (someday!) we may see them become real, but when? Well, as the saying goes, we have to be the change we want to see in the world. In this talk, I'll be showing off some fun sci-fi UI components (and building some!) to make that dream a little closer to reality!",
        "photo": "speakers/speaker-cassidy.jpg",
        "speakerBio": "Cassidy is a prcinipal developer experience engineer at Netlify. She's worked for CodePen, Amazon, Venmo, and more, and she's had the honor of working with various non-profit organizations, including cKeys and Hacker Fund as their Director of Outreach. She's active in the developer community and one of Glamour Magazine's 35 Women Under 35 Changing the Tech Industry and LinkedIn's Top Professionals 35 & Under. As an avid speaker, Cassidy has participated in several events including the Grace Hopper Celebration for Women in Computing, TEDx, the United Nations, and the U.S.A. Science and Engineering Festival. She wants to inspire generations of STEM students to be the best they can be, and her favorite quote is from Helen Keller: 'One can never consent to creep when one feels an impulse to soar.' She loves mechanical keyboards and karaoke.",
        "showBioExpands": true
      },
      {
        "time": "1:25 pm",
        "speaker": "Wes Bos and Scott Tolinski",
        "company": "Syntax.fm",
        "talkTitle": "Syntax Live!",
        "talkDescription": "Get Ready for a jam packed hour of tasty web development treats. Wes Bos and Scott Tolinski will record a live version of their popular weekly podcast that will include audience participation, web development trivia, terrible jokes and prizes to be won!",
        "photo": "speakers/speaker-syntax.jpg",
        "speakerBio": "Wes & Scott are prolific educators, conference speakers, workshop instructors, and co-hosts of the popular Syntax.fm podcast. Wes' courses can be found on WesBos.com, and Scott's courses can be found on leveluptutorials.com",
        "showBioExpands": true
      },
      {
        "time": "2:00 - 3:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Last minute networking",
        "talkDescription": "Hang out with your fellow attendees, speakers, and sponsors a bit longer while the conference app is still live!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "3:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "End of Day 2",
        "talkDescription": "That's the end of the official program schedule! Feel free to stick around to mingle & network with other attendees until 4:00 pm PST, when the event closes.",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      }
    ]
  }
]
