[
  {
    "date": "May 4",
    "subHeader": "AT A GLANCE",
    "timeline": [{
      "time":  "8:30 am",
      "label": "Gates Open"
    }, {
      "time": "10:00 am",
      "label": "First talk"
    }, {
      "time": "12:25 pm",
      "label": "Lunch"
    }, {
      "time": "5:00 pm",
      "label": "Talks end"
    }, {
      "time": "5:00 pm",
      "label": "Onsite Afterparty"
    }]
  },
  {
    "schedule": [
      {
        "time": "8:30 am",
        "speaker": null,
        "company": null,
        "talkTitle": "Breakfast & sponsor exhibits",
        "talkDescription": "Join us for coffee, tea, plus a wide selection of food including frittatas, quiche, fresh fruit, and whole grains! Come and chat with our 15 exciting sponsors who are exhibiting this year. Their booths are staffed by senior software engineers. Come learn about what they’re building, what problems they can solve for you and your team, and maybe even make a new friend!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "10:00 am",
        "speaker": "Anjana Vakil",
        "company": "Observable",
        "talkTitle": "Welcome & Introduction",
        "talkDescription": "Settle in for the welcome address by our Master of Ceremonies, Anjana Vakil",
        "photo": "speakers/speaker-anjana.jpg",
        "speakerBio": "Anjana suffers from a debilitating case of curiosity, which led her from philosophy to English teaching to computational linguistics to software development. She can often be found coding in San Francisco; that is, when she's not speaking at events around the world to share the joy of programming and advocate for a more diverse and inclusive tech industry. Ask her about the Recurse Center, Outreachy, and Mozilla TechSpeakers!",
        "showBioExpands": true
      },
      {
        "time": "10:05 am",
        "speaker": "Shruti Kapoor",
        "company": "Paypal",
        "talkTitle": "Everything you need to know about React 18",
        "talkDescription": "Full abstract coming soon -- The talk is about main concurrent features of React 18 for app developers, how to get started with React 18, how to migrate a React 17 or older app to 18, and demo of some concurrent features.",
        "photo": "speakers/speaker-shruti.jpg",
        "speakerBio": "Shruti is a Staff Engineer at PayPal and is passionate about teaching and sharing knowledge on JavaScript, React, GraphQL and front-end technologies. She shares byte sized javascript tidbits through her newsletter - JSByte: http://tinyletter.com/shrutikapoor. She is also an ardent #DevJoke fan",
        "showBioExpands": true
      },
      {
        "time": "10:30 am",
        "speaker": "Swizec Teller",
        "company": "Tia",
        "talkTitle": "Serverless for frontend enginers -- in 10 minutes",
        "talkDescription": "Talk abstract coming soon",
        "photo": "speakers/speaker-swizec.jpg",
        "speakerBio": "Swizec is a software engineer, author, educator, and conference speaker. He's published books on modern web technologies, data visualization, and productivity, and has trained engineering teams at Fortune500 companies. Now he's distilling 20 years of tacit experience into actionable steps.",
        "showBioExpands": true
      },
      {
        "time": "10:42 am",
        "speaker": "David Khourshid",
        "company": "Stately",
        "talkTitle": "Goodbye, useEffect",
        "talkDescription": "From fetching data to fighting with imperative APIs, side effects are one of the biggest sources of frustration in web app development. And let’s be honest, putting everything in useEffect hooks doesn’t help much. Thankfully, there is a science (well, math) to side effects, formalized in state machines and statecharts, that can help us visually model and understand how to declaratively orchestrate effects, no matter how complex they get. In this talk, we’ll ditch the useEffect hook and discover how these computer science principles can be used to simplify effects in our React apps.",
        "photo": "speakers/speaker-david.jpg",
        "speakerBio": "David is a software engineer who loves playing piano and is passionate about animations, state machines, cutting-edge user interfaces, and open-source. Previously at Microsoft, he is now the founder of Stately, a startup focused on making even the most complex application logic visual and accessible to developers and non-developers alike.",
        "showBioExpands": true
      },
      {
        "time": "11:05 - 11:40am",
        "speaker": null,
        "company": null,
        "talkTitle": "Break",
        "talkDescription": "Discuss the morning's topics with your fellow attendees, speakers, and visit the sponsor booths!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "11:45 am",
        "speaker": "Jenn Creighton",
        "company": "Netflix",
        "talkTitle": "Now and .then: Debugging Async JavaScript",
        "talkDescription": "Async JavaScript is mind-bending to write, even worse to debug. In this talk, we'll explore why async bugs are difficult, what common missteps create those bugs, and how to debug async code with the debugger.",
        "photo": "speakers/speaker-jenn.jpg",
        "speakerBio": "Jenn Creighton is a senior software engineer at Netflix on the NodeJS Platform Team. In her free time, she produces and hosts Single-Threaded, a podcast for software developers. She can be bribed with croissants. Find her online @gurlcode.",
        "showBioExpands": true
      },
      {
        "time": "12:10 pm",
        "speaker": "Ryan Florence",
        "company": "Remix",
        "talkTitle": "When To Fetch: Remixing React Router",
        "talkDescription": "We've learned that fetching in components is the quickest way to the worst UX. But it's not just the UX that suffers, the developer experience of fetching in components creates a lot of incidental complexity too: data fetching, data mutations, busy spinners, optimistic UI, error handling, form state, network race conditions, user event interruptions, and all the code that holds it together gets pretty difficult! As we've built Remix, we've gotten a lot of practice leaning on React Router's nested route abstraction to solve all of these problems all at once. Now, millions of React Router apps in production can get the same benefits because we've moved the responsibility of knowing When To Fetch into React Router itself!",
        "photo": "speakers/speaker-ryan.jpg",
        "speakerBio": "Ryan is the co-founder of Remix, co-creator of React Router, and co-founder of React Training.",
        "showBioExpands": true
      },
      {
        "time": "12:25 - 2:00pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Lunch",
        "talkDescription": "Grab lunch in the upper lounge by the Silver sponsors and grab a seat at one of the picnic tables shaded by the beautiful canopy of trees!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "1:30 - 1:50pm",
        "speaker": "Speaker TBD",
        "company": "Sanity",
        "talkTitle": "Lunch & Learn session with Sanity",
        "talkDescription": "Abstract coming soon",
        "photo": "speakers/speaker-tbd.jpg",
        "speakerBio": "Bio coming soon",
        "showBioExpands": true
      },
      {
        "time": "2:00 pm",
        "speaker": "Gant Laborde and Jamon Holmgren",
        "company": "Infinite Red",
        "talkTitle": "React Native: 2022 & Beyond",
        "talkDescription": "From our perspective of shipping countless React Native apps over the last seven years, React Native has grown and continues to evolve. There are some major changes coming! Most people have heard of \"the React Native bridge\", but have you heard of TurboModules, Fabric, and codegen?  This talk is a fast-pass to the front of the line in React Native’s upcoming new architecture and how it's going to recast cross-platform development. Let’s review what you need to know.",
        "photo": "speakers/speaker-gantjamon.jpg",
        "speakerBio": "Gant Laborde is an owner of Infinite Red, mentor, adjunct professor, published author, and award-winning speaker. For 20 years, he has been involved in software development and continues strong today. He is recognized as a Google Developer Expert in Web and Machine Learning, but informally he is an “open sourcerer” and aspires to one day become a mad scientist. He blogs, videos, and maintains popular repositories for the community. Jamon is a software developer, business owner, husband, and father of four, located near Portland, Oregon, in SW Washington state. He is one of the co-founders of Infinite Red, Inc., a fully remote React Native app development studio located across the USA and Canada. He learned to code at age twelve in order to make games (the game store was too far away from where he grew up) and that led to a lifelong obsession with coding. He is active in open source, plays ice hockey on a Finnish-American team, and takes any excuse to use his tractor that he can.",
        "showBioExpands": true
      },
      {
        "time": "2:25 pm",
        "speaker": "Michael Chan",
        "company": "Chromatic",
        "talkTitle": "Tame the Component Multiverse",
        "talkDescription": "Error state, loading state, awkward breakpoint, bad data, poor formatting, browser support. Every component is a multitude of challenges. How do you actually manage it? Disable the network — temporarily. Insert bad code — just for a minute. Paw at the edge of your screen. Hack local database fixtures to bits. Frontend development is a multiverse where dimensions like time and variation result in an infinite number of UI possibilities. In this talk, we'll use Storybook to progressively develop, test, document our work and tame the multiverse of our components.",
        "photo": "speakers/speaker-michael.jpg",
        "speakerBio": "Michael Chan loves the web. He's the host of React Podcast. And he's building Lunch Dev, the friendliest coding community for creative, curious, and compassionate web developers.",
        "showBioExpands": true
      },
      {
        "time": "2:50 - 3:30pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Break",
        "talkDescription": "Discuss the afternoon's topics with your fellow attendees, speakers, and visit the sponsor booths!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "3:35 pm",
        "speaker": "Shawn Swyx Wang",
        "company": "Temporal",
        "talkTitle": "The third age of JavaScript: Three years in",
        "talkDescription": "The way we write JavaScript in 2030 will be completely different than in 2020. With IE11 finally ending this year, the adoption of ES Modules have birthed a new generation of JavaScript tooling. These tools are faster, typesafer, and polyglot, leading to both a better developer and user experience. This talk is an in depth look into what's changed and what we've learned, 3 years in to the Third Age.",
        "photo": "speakers/speaker-swyx.jpg",
        "speakerBio": "Swyx has worked on React and serverless JavaScript at Two Sigma, Netlify and AWS, and now serves as Head of Developer Experience at Temporal.io. He has started and run communities for hundreds of thousands of developers, like Svelte Society, /r/reactjs, and the React TypeScript Cheatsheet. His nontechnical writing was recently published in the Coding Career Handbook for Junior to Senior developers.",
        "showBioExpands": true
      },
      {
        "time": "4:00 pm",
        "speaker": "Wes Bos and Scott Tolinski",
        "company": "Syntax.fm",
        "talkTitle": "Syntax Live!",
        "talkDescription": "Get Ready for a jam packed hour of tasty web development treats. Wes Bos and Scott Tolinski will record a live version of their popular weekly podcast that will include audience participation, web development trivia, terrible jokes and prizes to be won!",
        "photo": "speakers/speaker-syntax.jpg",
        "speakerBio": "Wes & Scott are prolific educators, conference speakers, workshop instructors, and co-hosts of the popular Syntax.fm podcast. Wes' courses can be found on WesBos.com, and Scott's courses can be found on leveluptutorials.com",
        "showBioExpands": true
      },
      {
        "time": "5:00 - 8:00pm",
        "speaker": null,
        "company": null,
        "talkTitle": "Onsite Afterparty!",
        "talkDescription": "Join your fellow attendees, speakers, and sponsors in conversation, food, and drinks for a few hours directly following the end of the program schedule!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      },
      {
        "time": "8:00 pm",
        "speaker": null,
        "company": null,
        "talkTitle": "End of Day 2",
        "talkDescription": "That's the end of the official program schedule! Feel free to stick around to mingle & network with other attendees!",
        "photo": null,
        "speakerBio": null,
        "showBioExpands": false
      }
    ]
  }
]
