[
  {
    "headline": "In-person technical workshops",
    "paragraph": null
  },
  {
    "workshops": [
      {
        "name": "Darius Cepulis",
        "company": "Mux",
        "title": "DevEx Engineer",
        "workshopTitle": "Up to speed with React Server Components",
        "time": "9:00am",
        "day": "Thursday, May 4 ",
        "length": "4 hours",
        "level": "Intermediate/Advanced",
        "headline": "Improve your app’s performance by shipping less client-side code",
        "paragraphOne": "Everyone’s buzzing about React Server Components – they’re the latest and greatest way to achieve performance gains within your React application. RSC turns a lot of what we’ve learned about Single-Page Applications on its head, so you might have a lot of questions around what all the fuss is about:",
        "bulletsOne": [],
        "paragraphTwo": null,
        "bulletsTwo": [
            "What’s the deal with RSC?",
            "What’s the difference between a server component and a client component?",
            "How do I use server components?",
            "What benefits do server components provide?",
            "How do I implement data fetching in server components?",
            "How can I stream in parts of my page as the server loads?",
            "How do I migrate to using server components?"
        ],
        "paragraphThree": "Good news: Mux has answers! In this workshop, you’ll learn from the Mux team’s experience about the pros and cons of moving to React Server Components in production. You’ll build a demo application showcasing how to leverage React Server Components with a real-world use case. And, as an added bonus, you’ll learn a thing or two about building with video along the way. Keep up to date with the latest in the React ecosystem with a fun-filled workshop at the Mux office–run by the video experts at Mux.",
        "bio": "Darius was looking for an embedded systems job when he made the happy mistake of stumbling into web development. He now spends most of his time enjoying CSS, talking animation curves with the designers, and recklessly shipping on Friday afternoons.",
        "photo": "/speakers/speaker-swizec.png",
        "buyTicketsUri": "https://lu.ma/rsc-workshop-reactathon-2023"
      }
    ]
  }
]
