[
  {
    "headline": "In-person technical workshops",
    "paragraph": "From half-day to full-day lessons, you'll learn in hours what our instructors have mastered over years. Tuesday, May 3 & Thursday, May 5. Full list of workshops to be announced soon. See the /about/faq/workshops section for answers to common questions."
  },
  {
    "workshops": [
      {
        "name": "Swizec Teller",
        "company": "Tia",
        "title": "Software Engineer",
        "workshopTitle": "Monetization + Auth on the Jamstack",
        "time": "7:30am",
        "date": "Monday, Dec 7",
        "length": "2 hours",
        "level": "Intermediate",
        "headline": "Learn how to monetize your Jamstack app, and add auth, in less than two hours.",
        "paragraphTwo": "Prerequisites:",
        "bulletsTwo": [
          "Familiar with JavaScript & React",
          "Able to fetch an API"
        ],
        "paragraphThree": "You’ll leave this 2-hour workshop knowing how to make money with your Jamstack app!",
        "bio": "Swizec is a prolific engineer, instructor, blogger, vlogger, conference speaker, and author. He's written many books including React + D3v4, Data Visualization with D3.js, the Severless Handbook, and others. He has trained the engineering teams from multiple Fortune 500 companies on React, Redux, GraphQL, Serverless, and other modern web technologies.",
        "photo": "/speakers/speaker-swizec.jpg",
        "buyTicketsUri": "https://hopin.com/events/reactathon-2020-online"
      },
      {
        "name": "Brad Westfall",
        "company": "React Training",
        "title": "Engineer & Instructor",
        "workshopTitle": "Intro to Compond Components",
        "time": "7:30am",
        "date": "Monday, Dec 7",
        "length": "2 hours",
        "level": "Intermediate",
        "headline": "Make Your React Components more composable with the ‘Compound Components’ Pattern",
        "paragraphTwo": "Prerequisites:",
        "bulletsTwo": [
          "Comfortable with JavaScript & React"
        ],
        "paragraphThree": "You’ll leave this full-day workshop knowing some of the most powerful (and fun!) technologies that make web development in 2020 so amazing.",
        "bio": "Brad is an engineer & instructor at React Training and the founder of the coder assessment tool Questionable.io.",
        "photo": "/speakers/speaker-brad.jpg",
        "buyTicketsUri": "https://hopin.com/events/reactathon-2020-online"
      },
      {
        "name": "Brandon Bayer",
        "company": "Blitz.js",
        "title": "Open Source Developer",
        "workshopTitle": "Learn Blitz.js & how easy it is to build fullstack apps",
        "time": "7:30am",
        "length": "2 hours",
        "level": "Beginner/Intermediate",
        "headline": "Folks are saying the \"The productivity is just insane!\". Experience it for yourself",
        "paragraphOne": "Blitz.js is a new fullstack framework that's built on Next.js. It adds a revolutionary \"zero-API\" data layer that abstracts the API into a compile step so you don't have to mess with it. No REST, no GraphQL. Simply import the server code into your components and BOOM it just works. And you still get client side rendering without relying on SSR. On top of that, it adds a number of conventions and tooling that are heavily inspired by Ruby on Rails. This results in the most productive experience for building fullstack React apps that we've ever seen. In this workshop we'll build a full Blitz app from the ground up, learning a bit about everything including the following:",
        "bulletsOne": [
          "Use the Blitz authentication system for user sign up and log in",
          "Use Prisma 2 to manage and access your database",
          "Write Blitz queries to read data on the client",
          "Write Blitz mutations to write data from the client"
        ],
        "paragraphTwo": "Recommended Prerequisites -- You will get the most out of this workshop if you:",
        "bulletsTwo": [
          "Are familiar with JavaScript",
          "Are comfortable with React",
          "Know a bit about databases and reading & writing data to them"
        ],
        "paragraphThree": null,
        "bio": "Brandon Bayer is the creator of Blitz.js. He is currently a full-time maintainer of Blitz. Outside of Blitz, his other passion is flying real airplanes and RC helicopters.",
        "photo": "/speakers/speaker-brandon.jpg",
        "buyTicketsUri": "https://hopin.com/events/reactathon-2020-online"
      },
      {
        "name": "Erik Rasmussen",
        "company": "ReduxForm & FinalFormJS",
        "title": "Author & Maintainer",
        "workshopTitle": "Modern Forms in React",
        "time": "7:30am",
        "date": "Tuesday, Dec 8",
        "length": "2 hours",
        "level": "Intermediate",
        "paragraphOne": "This workshop will take the students from building a two-field form using just useState() hooks, then adding validation, through to using a form library to manage complex form data such as field arrays, with support for field-level and record-level client-side validation as well as submit validation, and more. It will also touch on more complex concepts like minimizing field re-renders with a useField() hook, as well as subscribing to certain parts of form state with a useFormState() hook.\n\nStudents will walk away confident in their knowledge of how to build forms of any complexity with great UX.",
        "paragraphTwo": "Prerequisites:",
        "bulletsTwo": [
          "Comfortable with JavaScript & React"
        ],
        "paragraphThree": null,
        "bio": "American expat javascript developer, author of Redux Form and React Final Form.",
        "photo": "/speakers/speaker-erik.jpg",
        "buyTicketsUri": "https://hopin.com/events/reactathon-2020-online"
      },
      {
        "name": "Eve Porcello",
        "company": "Moon Highway",
        "title": "Technical Instructor",
        "workshopTitle": "GraphQL for React Developers",
        "time": "7:30am",
        "date": "Wednesday, Dec 9",
        "length": "2 hours",
        "level": "Intermediate",
        "headline": "GraphQL is changing the way that we think about data in our applications.",
        "paragraphOne": "So what does this mean for front-end developers and specifically React developers?\n\nIn this hands-on workshop, we’ll take a closer look at how to power up your applications with GraphQL and related tooling. We’ll start with an overview of GraphQL core concepts. Then we’ll learn how to fetch data from a GraphQL API with lightweight clients. From there, we’ll get into Apollo Client and how to use hooks for data fetching in components. Finally, we’ll look at how to automate your workflow with TypeScript and codegen.\n\nIn this workshop, we will cover:",
        "bulletsOne": [
          "GraphQL Overview",
          "Understanding GraphQL Clients",
          "Setting Up Apollo Client",
          "Fetching Data in React Components",
          "Apollo Codegen with TypeScript"
        ],
        "paragraphTwo": "Prerequisites -- You will get the most out of this workshop if you:",
        "bulletsTwo": [
          "Are familiar with JavaScript",
          "Are comfortable with React",
          "Have at least a vague idea of how web frontends talk to backends"
        ],
        "paragraphThree": null,
        "bio": "Eve Porcello is a software engineer and instructor at Moon Highway, a curriculum development and training company in Northern California. She has created courses for LinkedIn Learning and egghead.io and is the co-author of O’Reilly’s Learning React and Learning GraphQL.",
        "photo": "speakers/speaker-eve.jpg",
        "buyTicketsUri": "https://hopin.com/events/reactathon-2020-online"
      },
      {
        "name": "Mark Erikson",
        "company": "Northrop Grumman",
        "title": "Senior Software Engineer Engineer",
        "workshopTitle": "Modern Redux with Redux Toolkit",
        "time": "7:30am",
        "date": "Wednesday, Dec 9",
        "length": "2 hours",
        "level": "Intermediate",
        "headline": null,
        "paragraphOne": "Learn what Redux Toolkit is, why we created it, what problems it solves, how to use it effectively, migrating from plain Redux, and more.",
        "paragraphTwo": "Prerequisites:",
        "bulletsTwo": [
          "Comfortable with JavaScript & React",
          "Familiar with Redux"
        ],
        "paragraphThree": "Working knowledge of Javascript\nFamiliarity with ES6+",
        "bio": "Mark is a software engineer living in southwest Ohio, USA, where he patiently awaits the annual heartbreak from the Reds and the Bengals. Mark is a Redux maintainer, author of the Redux FAQ, maintains the React/Redux Links list and Redux Addons Catalog, tweets at @acemarke, and blogs at https://blog.isquaredsoftware.com. He can be usually found in the Reactiflux chat channels, answering questions about React and Redux.",
        "photo": "speakers/speaker-mark.jpg",
        "buyTicketsUri": "https://hopin.com/events/reactathon-2020-online"
      }
    ]
  }
]
