[
  {
    "headline": "In-person technical workshops",
    "paragraph": "From half-day to full-day lessons, you'll learn in hours what our instructors have mastered over years. Tuesday, May 3 & Friday, May 6. See the /about/faq/workshops section for answers to common questions."
  },
  {
    "workshops": [
      {
        "name": "Swizec Teller",
        "company": "Tia",
        "title": "Software Engineer",
        "workshopTitle": "Senior Mindset workshop: Think like a *true* senior engineer",
        "time": "10:00am",
        "day": "Tuesday, May 3 ",
        "length": "4 hours",
        "level": "Intermediate/Advanced",
        "headline": "Getting that senior title is easy. Just stick around. Being a true senior takes a new way of thinking.",
        "paragraphOne": "You're a great engineer. You can code anything you need, solve every problem, google any solution. Your code is flying.",
        "bulletsOne": [],
        "paragraphTwo": "But somehow you're ... stuck. Interviewing feels rough, you pass the coding and fail the real stuff. Culture and system.\n\nAt work they keep giving you stupid little problems with no growth. You crave challenge and keep tweaking CSS instead. You want some responsibility, damn it! What's that coworker got that you don't?\n\nMost of all you crave autonomy. The freedom to tackle big challenges and help the company with your brilliance. They don't even see all the bad code you see! How can they live like this??\n\nInstead of autonomy, you're getting babysat. Managers asking what you're up to, daily standups that feel like a drag, pushback and 'maybe someday' on every idea that you give.\n\nI was like that a few years ago. A totally senior engineer who keeps running into walls and getting stuck. Now even bigger companies trust me with designing systems and leading teams on projects that could make or break the company.\n\nIn this workshop you'll learn what changed and how to apply the Senior Mindset to your work and career:",
        "bulletsTwo": [
            "How to gain autonomy",
            "Inspire trust",
            "Own large projects",
            "Get freedom to experiment",
            "Have your ideas heard",
            "Think like an expert",
            "Become a decision-making peer, not a pair of hands"
        ],
        "paragraphThree": "You'll work on case studies, analyze anecdotes, discuss insightful books, and look at your work and career in a new light.",
        "bio": "Swizec is a software engineer, author, educator, and conference speaker. He's published books on modern web technologies, data visualization, and productivity, and has trained engineering teams at Fortune500 companies. Now he's distilling 20 years of tacit experience into actionable steps.",
        "photo": "/speakers/speaker-swizec.png",
        "buyTicketsUri": "https://ti.to/real-world-react/crafting-a-senior-engineering-mindset/"
      },
      {
        "name": "Anjana Vakil",
        "company": "",
        "title": "Software Developer & Developer Advocate",
        "workshopTitle": "Interactive Data Visualizations with Observable Plot + React",
        "time": "10:00am",
        "day": "Friday, May 6 ",
        "length": "4 hours",
        "level": "Novice/Intermediate",
        "headline": "An introduction to data visualization for web developers",
        "paragraphOne": "Data Visualization, aka 'dataviz', is much more than drawing some pretty charts; it's a process of discovering & communicating insights derived from data. As web developers, we are luckily swimming in data about the apps we build, the users who interact with them, and the development workflows we use to build them. We may be used to looking at certain visualizations of that data - e.g. a simple line graph or bar chart presented by our analytics platform - but many developers don't realize that with very little time & effort, we can build our own visualizations to dig deeper and answer the specific questions that really matter to us and our work. ",
        "paragraphTwo": "In this workshop, through hands-on projects we'll learn how to use Plot, an open source dataviz library, and Observable, a browser-based reactive coding platform, to rapidly build insightful, interactive visualizations in JavaScript and embed them in our React apps. After completing this workshop, you'll have the basic tools & techniques you need to start using dataviz to better understand your code, your projects & your users, and make better data-driven decisions as a developer.",
        "bulletsTwo": [
          "Introduction: What is dataviz & how does it help developers?",
          "Project 1: Are integration tests passing? (Features & encoding channels)",
          "Project 2: What devices are users browsing with? (Aggregation & faceting)",
          "Project 3: How fast are API responses? (Interactivity & user inputs)",
           "Project 4: Incorporating visualizations into React apps",
          "Conclusion: Takeaways & next steps "
        ],
        "paragraphThree": "Basic familiarity with JavaScript & React will be assumed, but developers of all levels are welcome. Participants should bring a laptop with a modern web browser and code editor of their choice, or may choose to use a web-based development environment e.g. CodeSandbox. We'll be working with Observable notebooks, and a free observablehq.com account is optional, but not required.",
        "bio": "Anjana suffers from a chronic case of curiosity, which led her from philosophy to English teaching to computational linguistics to software development. As a developer advocate and full-stack software developer, these days she codes & teaches from her home base in San Francisco; in the before-times, you could find her speaking at events around the world. She loves to share the joy of programming and advocate for a more diverse, equitable, and ethical tech industry. Ask her about the Recurse Center & Outreachy, she’s an alumna of both!",
        "photo": "/speakers/speaker-anjana.png",
        "buyTicketsUri": "https://ti.to/real-world-react/data-visualizations-with-javascript"
      },
      {
        "name": "Kent C. Dodds",
        "company": "Remix.run",
        "title": "Director of Developer Experience",
        "workshopTitle": "Introduction to the Remix Web Framework",
        "time": "9:00am",
        "day": "Friday, May 6",
        "length": "7 hours",
        "level": "All Levels",
        "headline": "Build Better Web Apps with Remix",
        "paragraphOne": "Building modern web applications is riddled with complexity. And that's only if you bother to deal with the problems.\n\nTired of wiring up onSubmit to backend APIs and making sure your client-side cache stays up-to-date? Wouldn't it be cool to be able to use the global nature of CSS to your benefit, rather than find tools or conventions to avoid or work around it? And how would you like nested layouts with intelligent and performance optimized data management that just works™?\n\nRemix solves some of these problems, and completely eliminates the rest. You don't even have to think about server cache management or global CSS namespace clashes. It's not that Remix has APIs to avoid these problems, they simply don't exist when you're using Remix. Oh, and you don't need that huge complex graphql client when you're using Remix. They've got you covered. Ready to build faster apps faster?",
        "bulletsOne": [
          "Take advantage of nested routing",
          "Write dead simple mutations",
          "Style your app with CSS",
          "Improve your site performance... As in speed, but also for search rankings",
          "Completely eliminate pending states",
          "Handle errors"
        ],
        "paragraphTwo": "Prerequisites:",
        "bulletsTwo": [
          "Have experience with fundamentals of JavaScript (https://kentcdodds.com/blog/javascript-to-know-for-react).",
          "Go Kent's \"Beginner's Guide to React\" (https://kcd.im/beginner-react), or have a good understanding of React."
        ],
        "paragraphThree": null,
        "bio": "Kent C. Dodds is a world renowned speaker, teacher, and trainer and he's actively involved in the open source community as a maintainer and contributor of hundreds of popular npm packages. Kent is a Co-Founder and Director of Developer Experience at Remix. He is the creator of EpicReact.Dev and TestingJavaScript.com. He's an instructor on egghead.io and Frontend Masters. He's also a Google Developer Expert. Kent is happily married and the father of four kids. He likes his family, code, JavaScript, and React.",
        "photo": "/speakers/speaker-kent.png",
        "buyTicketsUri": "https://ti.to/real-world-react/introduction-to-remix-web-framework"
      }
    ]
  }
]
