[
  {
    "speakers": [
      {
        "name": "Guillermo Rauch",
        "company": "ZEIT",
        "title": "Founder & CEO",
        "talkTitle": "Keynote",
        "talkAbstract": "Abstract coming soon",
        "bio": "Guillermo Rauch is the founder of ZEIT, co-creator of Now and Next.js, and former CTO and co-founder of LearnBoost and Cloudup, acquired by Wordpress.com in 2013. His background and expertise is in the realtime web. He's the creator of socket.io, one of the most popular JavaScript projects on GitHub, with implementations in many different programming languages and frameworks (currently running the realtime backend of high profile apps like Microsoft Office online). He created the first MongoDB ORM for Node.JS, MongooseJS. Before that he was a core developer of the MooTools JavaScript framework. He's the author of 'Smashing Node.JS' published by Wiley in 2012, best-selling book about Node.JS on Amazon in multiple programming categories. He's spoken at dozens of conferences all around the world about JavaScript and the realtime web, such as O'Reilly OSCON, QCon and NDC. Originally from Argentina, he dropped out of high school and moved to the US to pursue his passions in the San Francisco startup world. He's passionate about open source as an education medium. He's a former mentor of an Open Source Engineering class organized and pioneered by Stanford, with students from Harvard, MIT, Carnegie Mellon, UPenn, Columbia and others.",
        "headerBio": "Guillermo Rauch is the founder of ZEIT and the co-creator of Now and Next.js. He has been involved with React since the very beginning, and was a core-contributor to MooTools, React's spiritual predecessor.",
        "photo": "speaker-guillermo.jpg",
        "photoHover": "speaker-guillermo-hover.jpg",
        "photoHeader": "speaker-guillermo-header.png",
        "video": null,
        "podcast": {
          "src": "https://hwcdn.libsyn.com/p/1/f/0/1f09fe1ea7b4896d/2020_03_02_nextjsGuillermoRauch.mp3?c_id=66255890&amp;cs_id=66255890&amp;expiration=1583398286&amp;hwt=badf500d2e982960d49147c27fffad2d",
          "isExternal": true,
          "track": "Software Engineering Daily Episodes"
        },
        "twitter": "rauchg",
        "github": "rauchg",
        "website": "https://zeit.co"
      },
      {
        "name": "Naomi Meyer",
        "company": "Adobe",
        "title": "Software Engineer",
        "talkTitle": "Building React Apps with Internationalization (I18N) in Mind",
        "talkAbstract": "At Adobe we build products for the world, this talk with provide a high level overview of internationalization (I18N), localization (L10N), and globalization (G11N) best practices - specifically within a React context. We'll go over why these are important and how best to implement in design, UX, and within the codebase - using React examples as well as React and JavaScript tool recommendations.",
        "bio": "Naomi works as a Software Development Engineer at Adobe in New York City, where she is the product champion for internationalization (i18n) on her team. Before writing JavaScript full time, Naomi worked teaching English as a foreign language in local classrooms across Asia and West Africa. She is passionate about developing with diversity, inclusion, and internationalization (i18n) in mind, and enjoys hiking and riding bikes on the weekends.",
        "headerBio": "Naomi works as a Software Development Engineer at Adobe in New York City, where she is the product champion for internationalization (i18n) on her team.",
        "photo": "speaker-naomi.jpg",
        "photoHover": "speaker-naomi-hover.jpg",
        "photoHeader": "speaker-naomi-header.png",
        "video": null,
        "podcast": null,
        "twitter": "nae_ohmi",
        "github": "naeohmi",
        "website": "https://naeohmi.github.io/me"
      },
      {
        "name": "Cassidy Williams",
        "company": "React Training",
        "title": "Instructor & Developer",
        "talkTitle": "The Future is Now: Building Sci-Fi-Inspired User Interfaces",
        "talkAbstract": "Chances are at some point in your life, you've seen some fun sci-fi movie where there's this glorious futuristic user interface. They're full of beautiful colors and graphs and glowy stuff, and they're just generally cooler than what we have now. Someday (someday!) we may see them become real, but when? Well, as the saying goes, we have to be the change we want to see in the world. In this talk, I'll be showing off some fun sci-fi UI components (and building some!) to make that dream a little closer to reality!",
        "bio": "Cassidy is an instructor and developer with React Training. She's worked for CodePen, Amazon, Venmo, and more, and she's had the honor of working with various non-profit organizations, including cKeys and Hacker Fund as their Director of Outreach. She's active in the developer community and one of Glamour Magazine's 35 Women Under 35 Changing the Tech Industry and LinkedIn's Top Professionals 35 & Under. As an avid speaker, Cassidy has participated in several events including the Grace Hopper Celebration for Women in Computing, TEDx, the United Nations, and the U.S.A. Science and Engineering Festival. She wants to inspire generations of STEM students to be the best they can be, and her favorite quote is from Helen Keller: 'One can never consent to creep when one feels an impulse to soar.' She loves mechanical keyboards and karaoke.",
        "headerBio": "Cassidy is an instructor & developer at React Training",
        "photo": "speaker-cassidy.jpg",
        "photoHover": "speaker-cassidy-hover.jpg",
        "photoHeader": "speaker-cassidy-header.png",
        "video": null,
        "podcast": null,
        "twitter": "cassidoo",
        "github": "cassidoo",
        "website": "https://cassidoo.co"
      },
      {
        "name": "Evan Bacon",
        "company": "Expo",
        "title": "Open Source Developer",
        "talkTitle": "Build it once with Expo for the Web",
        "talkAbstract": "Using Expo you can build an app that runs natively for iOS, Android, and in the web browser. You’ll see how Expo and React Native for web enable you to use cutting-edge browser functionality to create progressive web apps that emulate the functionality of your native app as closely as possible. You’ll also learn what you can do with it, why you would use it, and how it works with other popular web development tools..",
        "bio": "Bacon is a full-time open source developer working on Expo to make hyper-performant universal apps that run everywhere, and are used by incredible companies like Flexport, Pizza Hut, and Brex. He's built over 100 NPM packages, was the all-time youngest designer at the prestigious design firm Frog Design, and is a world renowned, award-winning Lego Master Builder. Besides programming Expo non-stop, Bacon enjoys making YouTube videos about Expo, tweeting about Expo, and drinking Soylent while thinking about Expo.",
        "headerBio": "Bacon is a full-time open source developer working on Expo to make hyper-performant universal apps that run everywhere",
        "photo": "speaker-evan.jpg",
        "photoHover": "speaker-evan-hover.jpg",
        "photoHeader": "speaker-evan-header.png",
        "video": "https://www.youtube.com/watch?v=_KYN8-g5TNU",
        "podcast": {
          "src": "https://audio.simplecast.com/7cf352f9.mp3",
          "isExternal": true,
          "track": "The React Podcast"
        },
        "twitter": "baconbrix",
        "github": "EvanBacon",
        "website": "https://evanbacon.dev"
      },
      {
        "name": "Kent C. Dodds",
        "company": "KentCDodds.com",
        "title": "Software Engineer & Teacher",
        "talkTitle": "Keynote: Managing React Application State Management",
        "talkAbstract": "Application State Management is one of the hardest parts of building and maintaining React Applications. The number of options you have is numerous and the reason is that it's just such a hard problem with so many nuances and trade-offs. One thing that makes application state management harder is when we aren't thoughtful about how that state is organized and categorized in our app. There are different kinds of state and they require different approaches for management. When you try to treat all app state exactly the same is when problems come into play. Let's talk about what some of those categories are and how we can drastically simplify our application code and improve our app's performance by thinking about and organizing our state differently.",
        "bio": "Kent C. Dodds is a world-renowned speaker, teacher, and trainer who is actively involved in the open source community as a maintainer and contributor of hundreds of popular npm packages. Kent is the creator of TestingJavaScript.com, and he's an instructor on egghead.io and Frontend Masters. He's also a Google Developer Expert. Kent is happily married and the father of four kids. He likes his family, code, JavaScript, and React.",
        "headerBio": "Kent C. Dodds is a world-renowned speaker, teacher, and trainer who is actively involved in the open source community as a maintainer and contributor of hundreds of popular npm packages.",
        "photo": "speaker-kent.jpg",
        "photoHover": "speaker-kent-hover.jpg",
        "photoHeader": "speaker-kent-header.png",
        "video": "https://www.youtube.com/watch?v=I8Wq6_Z8MwY",
        "podcast": {
          "src": "kent-c.-dodds",
          "isExternal": false
        },
        "twitter": "kentcdodds",
        "github": "kentcdodds",
        "website": "https://kentcdodds.com"
      },
      {
        "name": "Daria Caraway",
        "company": "Workday",
        "title": "Software Engineer",
        "talkTitle": "Building Considerate React Component APIs with TypeScript",
        "talkAbstract": "TypeScript is often praised for adding a layer of bug protection on top of JavaScript applications. But, how can we also use TypeScript to improve the readability of our React component interfaces for our fellow team members? Just because types compile, doesn’t mean they are helping to document and describe our code for our future selves and others. Perhaps we can shift our perspective about TypeScript from a bug catching tool to a developer experience tool that enables us to write reasonable and intuitive code interfaces. In this talk, you will learn how to think like a consumer and take advantage of basic and advanced TypeScript types to enhance the readability of your React component APIs.",
        "bio": "Daria is a Speaker, Certified Scrum Master and Software Engineer at Workday where she builds consumer grade experiences for the enterprise user. Daria currently resides in her hometown of Boulder, Colorado where she will often be found at the rock climbing gym or hanging out with her cat, Odin.",
        "headerBio": "Daria is a Speaker, Certified Scrum Master and Software Engineer at Workday where she builds consumer grade experiences for the enterprise user.",
        "photo": "speaker-daria.jpg",
        "photoHover": "speaker-daria-hover.jpg",
        "photoHeader": "speaker-daria-header.png",
        "video": null,
        "podcast": {
          "src": "https://audio.simplecast.com/e12f06e4.mp3",
          "isExternal": true,
          "track": "The React Podcast"
        },
        "twitter": "dariacaraway",
        "github": "darcar31",
        "website": "http://www.dariacaraway.com"
      },
      {
        "name": "Tejas Kumar",
        "company": "G2i",
        "title": "Head of Vetting",
        "talkTitle": "Inside React: A Deeper Look",
        "talkAbstract": "We spend a lot of time using React as a component abstraction layer on the DOM. This talk peeks under the surface as we explore together what makes React, React.",
        "bio": "Tejas has been programming since age 8. From vanilla JavaScript, through popular JavaScript libraries like jQuery, scriptaculous and mootools, through React. He has built large, profitable React applications over his tenure for a number of establishments, as well as open source design systems and data-related libraries. Tejas believes the component model of React, in addition to high developer sensitivity from the core team is what has led to React's dominance of the modern web platform.",
        "headerBio": "Tejas has been programming since age 8. From vanilla JavaScript, through popular JavaScript libraries like jQuery, scriptaculous and mootools, through React.",
        "photo": "speaker-tejas.jpg",
        "photoHover": "speaker-tejas-hover.jpg",
        "photoHeader": "speaker-tejas-header.png",
        "video": null,
        "podcast": {
          "src": "tejas-kumar"
        },
        "twitter": "tejaskumar_",
        "github": "tejasq",
        "website": "https://www.tejaskumar.com"
      },
      {
        "name": "Wes Bos",
        "company": "WesBos.com",
        "title": "Engineer & Entrepreneur",
        "talkTitle": "Syntax Live!",
        "talkAbstract": "Get Ready for a jam packed hour of tasty web development treats. Wes Bos and Scott Tolinski will record a live version of their popular weekly podcast that will include audience participation, web development trivia, terrible jokes and prizes to be won!",
        "bio": "Wes is a prolific educator, conference speaker, workshop instructor, and co-host of the popular Syntax.fm podcast. He loves creating educational courses on web development. He lives and works in Hamilton, Canada. ",
        "headerBio": "Wes is a prolific educator, conference speaker, workshop instructor, and co-host of the popular Syntax.fm podcast. He loves creating educational courses on web development.",
        "photo": "speaker-wes.jpg",
        "photoHover": "speaker-wes-hover.jpg",
        "photoHeader": "speaker-wes-header.png",
        "video": null,
        "podcast": null,
        "twitter": "wesbos",
        "github": "wesbos",
        "website": "https://www.wesbos.com"
      },
      {
        "name": "Jana Beck",
        "company": "Stitch Fix",
        "title": "Data Visualization Engineer",
        "talkTitle": "Escaping flatland: a romance of data science in the browser.",
        "talkAbstract": "React’s top-down data flow has always been a particularly good fit for building data visualizations. In this talk, we’ll look at using React in combination with some web standard technologies—Web Workers and OffscreenCanvas—to do dimensionality reduction in the browser. Dimensionality reduction—and in particular here, UMAP—is a data science technique that is often used to facilitate visual exploration of high-dimensional datasets, but until recently it’s been too computationally expensive to do live and on demand in the browser. We’ll show how to wrap a JavaScript implementation of UMAP into a DX-friendly custom React hook, and we’ll dive deep into the specific features of Web Workers that aid in making it possible to perform tasks typically reserved for cloud computing jobs in the browser, albeit on smaller samples from data sets. These features include transferable objects, which allow for efficient, zero-copy passing of computed results back to the browser from the Worker and OffscreenCanvas, a bleeding edge browser feature that can let us even perform the visual rendering of the UMAP result without leaving the Worker.",
        "bio": "Jana took the long road to web development with a significant delay as a Ph.D. candidate in linguistics doing a lot of scientific computing in Python. Today she works as a front end engineer supporting data scientists at Stitch Fix. When she's not coding or sleeping, there's a high probability that Jana is sweating in a dance studio or a gym.",
        "headerBio": "Jana is a front-end engineer supporting data scientists at Stitch Fix",
        "photo": "speaker-jana.jpg",
        "photoHover": "speaker-jana-hover.jpg",
        "photoHeader": "speaker-jana-header.png",
        "video": null,
        "podcast": null,
        "twitter": "ipancreas",
        "github": "jebeck",
        "website": "http://janabeck.com"
      },
      {
        "name": "David Khourshid",
        "company": "Microsoft",
        "title": "Software Engineer",
        "talkTitle": "State: The Next (Auto-)Generation",
        "talkAbstract": "Diagrams, user stories, tests, documentation. If you just sighed, you're one of many developers who know the hardships of keeping these vital parts of software in sync with the apps you develop. But what if there was a way to autogenerate these? Enter model-driven development. In this talk, we'll explore how state machines and statecharts can be used to model even the most complex logic and automatically visualize, generate tests, produce documentation, and more. Learn how to leverage models, save time, and ship faster, more robust React apps.",
        "bio": "David Khourshid (known on Twitter as David K. Piano) is a software engineer for Microsoft, a tech author, and speaker. Also a fervent open-source contributor, he is passionate about statecharts and software modeling, reactive animations, innovative user interfaces, and cutting-edge front-end technologies. When not behind a computer keyboard, he’s behind a piano keyboard or traveling.",
        "headerBio": "David Khourshid is a software engineer for Microsoft, a tech author, and speaker.",
        "photo": "speaker-david.jpg",
        "photoHover": "speaker-david-hover.jpg",
        "photoHeader": "speaker-david-header.png",
        "video": null,
        "podcast": {
          "src": "https://media.simplecast.com/episodes/audio/317091/83_David_Khourshid.mp3",
          "isExternal": true,
          "track": "The React Podcast"
        },
        "twitter": "DavidKPiano",
        "github": "davidkpiano",
        "website": "https://codepen.io/davidkpiano"
      },
      {
        "name": "Christian Nwamba",
        "company": "Microsoft",
        "title": "Software Engineer",
        "talkTitle": "Talk title coming soon",
        "talkAbstract": "Abstract coming soon",
        "bio": "Christian Nwamba is a developer advocate at Microsoft. He’s keen about the next billion users and emerging tech markets. He’s constantly seeking for more ways to make technology accessible to beginners, developing countries, underrepresented groups, etc.",
        "headerBio": "Christian Nwamba is a developer advocate at Microsoft, passionate about making technology accessible to beginners, developing countries, and underrepresented groups.",
        "photo": "speaker-chris-nwamba.jpg",
        "photoHover": "speaker-chris-nwamba-hover.jpg",
        "photoHeader": "speaker-chris-nwamba-header.png",
        "video": null,
        "podcast": null,
        "twitter": "codebeast",
        "github": "christiannwamba",
        "website": "https://www.codebeast.dev"
      },
      {
        "name": "Swizec Teller",
        "company": "Yup Technologies",
        "title": "Software Engineer",
        "talkTitle": "Add authentication to your React app in 5 minutes with useAuth",
        "talkAbstract": "Authentication is one of the fiddliest features to add to your single page app. You have to deal with JWT tokens, implement a server, keep track of users and permissions, deal with OAuth if you want social logins and that's just the backend. The client app then has to keep track of state, propagate it through your component tree, enable logging in and out, implement a form, and it's just a mess. So I built useAuth that handles all that for you. Use it as a React Hook anywhere and it handles the rest. 5min to set up ✌️",
        "bio": "Swizec is a prolific engineer, instructor, blogger, streamer, conference speaker, and author. He's published many books and courses including React for DataViz, React + D3v4, Data Visualization with D3.js, the work-in-progress Serverless Handbook, and others. He maintains a Rails app pulling 20 requests per second, a serverless system doing a million requests per day, and wishes his side projects were just as popular.",
        "headerBio": "Swizec is a prolific engineer, instructor, blogger, streamer, conference speaker, and author.",
        "photo": "speaker-swizec.jpg",
        "photoHover": "speaker-swizec-hover.jpg",
        "photoHeader": "speaker-swizec-header.png",
        "video": "https://www.youtube.com/watch?v=GiWrKZzKfZI",
        "podcast": null,
        "twitter": "swizec",
        "github": "swizec",
        "website": "https://swizec.com"
      },
      {
        "name": "Alex Krolick",
        "company": "Box",
        "title": "Software Engineer",
        "talkTitle": "Testing Async Components Using React Testing Library",
        "talkAbstract": "Learn how to test async code in React applications using React Testing Library! This talk will show you how to test async code such as networks calls, timers, and Promises in React components, and will show you how to use the new 'act' function from React DOM test-utils to be sure your tests (and app!) work with the new React features like Suspense and Concurrent Mode. Bonus: you'll learn when and why to write higher-level end-to-end tests with tools like Cypress.",
        "bio": "Alex is a React Testing Library maintainer and software engineer at Box, Inc.",
        "headerBio": "Alex is a React Testing Library maintainer and software engineer at Box, Inc. ",
        "photo": "speaker-alex.jpg",
        "photoHover": "speaker-alex-hover.jpg",
        "photoHeader": "speaker-alex-header.png",
        "video": null,
        "podcast": null,
        "twitter": null,
        "github": "alexkrolick",
        "website": "https://alexkrolick.com"
      },
      {
        "name": "Becca Bailey",
        "company": "Formidable",
        "title": "Software Engineer",
        "talkTitle": "Konmari Your Code: Finding Joy in Refactoring",
        "talkAbstract": "There’s something deeply satisfying about refactoring React components. Refactoring can help us to simplify, create a foundation for the future, and better communicate our intentions for our codebase. But nothing kills your joy like unintentional changes to existing logic! This talk shares some tips and tricks for stress-free refactoring, like aiming for simplification of logic over premature abstraction, and testing behavior without getting bogged down in implementation details. With a little bit of time and intentionality, we can keep the code that brings us joy and refactor all the rest.",
        "bio": "Becca is a Frontend Engineer at Formidable with a deep love of React, Typescript, and GraphQL. After a previous career as an elementary music and fine arts teacher, she loves helping artists and career-changers understand software.",
        "headerBio": "Becca is a Frontend Engineer at Formidable with a deep love of React, Typescript, and GraphQL.",
        "photo": "speaker-becca.jpg",
        "photoHover": "speaker-becca-hover.jpg",
        "photoHeader": "speaker-becca-header.png",
        "video": "https://www.youtube.com/watch?v=VTfQc0VFiK0",
        "podcast": {
          "src": "https://media.simplecast.com/episodes/audio/316848/82_Becca_Bailey.mp3",
          "isExternal": true,
          "track": "The React Podcast"
        },
        "twitter": "beccaliz",
        "github": "beccanelson",
        "website": "https://becca.is"
      },
      {
        "name": "Bryan Manuele",
        "company": "Flexport",
        "title": "Software Engineer",
        "talkTitle": "Quantifying the health of a React Codebase",
        "talkAbstract": "Learn how to leverage metrics to gain insight into the health of your React code base. This talk will cover how Flexport uses static analysis to gain insight on how internal components and APIs are being used, the decisions and insights these metrics can drive, and how you can implement these metrics on your own React code base. By the end of this talk, you will learn how you can write your own custom abstract syntax tree (AST) parsers to gain insight into your own React codebase, and learn about the successes we've had at Flexport using this system.",
        "bio": "Bryan is a Software Engineer at Flexport in San Francisco. An open source aficionado, Bryan has contributed to open source projects ranging from React to Lodash, and is a maintainer of Latitude -- the open source design system at Flexport.",
        "headerBio": "Bryan is an open source aficionado and a Software Engineer at Flexport.",
        "photo": "speaker-bryan.jpg",
        "photoHover": "speaker-bryan-hover.jpg",
        "photoHeader": "speaker-bryan-header.png",
        "video": "https://www.youtube.com/watch?v=kg7PuiBGSvA",
        "podcast": null,
        "twitter": "Fermi_Dirak",
        "github": "FermiDirak",
        "website": "https://fermidirak.github.io"
      },
      {
        "name": "Brian Leroux",
        "company": "Begin.com",
        "title": "CTO",
        "talkTitle": "Let's put Deno into production",
        "talkAbstract": "Deno is a brand new JavaScript runtime from the creator of Node with many compelling characteristics. We can anticipate many folks will be trialing Deno in 2020 whenever it hits the 1.0 milestone. Lambda makes it easy to spin up a custom runtime behind the hyperscale serverless infrastructure of AWS. Combined these ideas are recklessly powerful. A pre-1.0 JavaScript runtime running on the cloud at first appears to be an inadvisable idea. The ecosystem is young! APIs will probably change! On the other hand, Lambda custom runtimes are isolated stateless execution environments that marshall JSON strings. Deno is based on V8 which is a very battle hardened tool for dealing with JSON strings. And the Deno standard library while subject to change before 1.0 is quite stable for most common tasks.  In this talk we go deep into Deno. We’ll deploy a serverless backend to AWS with Deno and compare it directly to Node. How it works, what sets it apart from Node, what sorts of programs it is currently suitable for and where it is likely to go.",
        "bio": "Brian is the cofounder and CTO of Begin.com, the fastest and easiest way to setup CI/CD gitops for serverless web apps on AWS. He is the creator and maintainer of OpenJS Architect, an open-source framework for generating and deploying AWS standard SAM/CloudFormation and coined the term FASTstack. He has been keeping a close eye on Deno since its earliest moments and is already using it in production today. You can catch him @brianleroux on Twitter where he talks about open source, JavaScript, serverless, faststack, Deno, and other developer-related stuff.",
        "headerBio": "Brian is a Serverless expert and the co-founder and CTO of Begin.com, a platform for building and deploying modern web apps, sites, and APIs.",
        "photo": "speaker-brian.jpg",
        "photoHover": "speaker-brian-hover.jpg",
        "photoHeader": "speaker-brian-header.png",
        "video": null,
        "podcast": {
          "src": "https://hwcdn.libsyn.com/p/5/2/8/528679e1515472df/2020_03_04_BeginBrianLeRoux.mp3?c_id=66374477&cs_id=66374477&expiration=1583397375&hwt=f261a0072bbf7af4e6f3fe96033133d8",
          "isExternal": true,
          "track": "Software Engineering Daily Episodes"
        },
        "twitter": "brianleroux",
        "github": "brianleroux",
        "website": "https://begin.com"
      },
      {
        "name": "Lydia Hallie",
        "company": "Independent",
        "title": "Software Engineer",
        "talkTitle": "JavaScript Visualized: Understanding how the V8 engine works",
        "talkAbstract": "JavaScript is cool (don't @ me), but how can a machine actually understand the code you've written? As JavaScript devs, we usually don't have to deal with compilers ourselves. In this talk, I’ll use visualizations to show you how the JavaScript engine handles our human-friendly code, and compiles it to code that machines understand.",
        "bio": "Lydia Hallie is a full-time software engineering consultant and  educator that primarily works with JavaScript, React, Node, GraphQL, and serverless technologies. She also spends her time mentoring and doing in-person training sessions.",
        "headerBio": "Lydia Hallie is a full-time software engineering consultant and  educator that primarily works with JavaScript, React, Node, GraphQL, and serverless technologies.",
        "photo": "speaker-lydia.jpg",
        "photoHover": "speaker-lydia-hover.jpg",
        "photoHeader": "speaker-lydia-header.png",
        "video": null,
        "podcast": null,
        "twitter": "lydiahallie",
        "github": "lydiahallie",
        "website": "https://www.lydiahallie.dev"
      },
      {
        "name": "Scott Tolinski",
        "company": "Level Up Tutorials",
        "title": "Engineer & Entrepreneur",
        "talkTitle": "Syntax Live!",
        "talkAbstract": "Get Ready for a jam packed hour of tasty web development treats. Wes Bos and Scott Tolinski will record a live version of their popular weekly podcast that will include audience participation, web development trivia, terrible jokes and prizes to be won!",
        "bio": "Scott is a prolific educator, conference speaker, workshop instructor, and co-host of the popular Syntax.fm podcast. He loves creating educational courses on web development through leveluptutorials.com. He lives and works in Denver, Colorado. ",
        "headerBio": "Scott is a prolific educator, conference speaker, workshop instructor, and co-host of the popular Syntax.fm podcast.",
        "photo": "speaker-scott.jpg",
        "photoHover": "speaker-scott-hover.jpg",
        "photoHeader": "speaker-scott-header.png",
        "video": null,
        "podcast": null,
        "twitter": "stolinski",
        "github": "stolinski",
        "website": "https://www.leveluptutorials.com"
      },
      {
        "name": "Ryan Florence",
        "company": "React Training",
        "title": "Co-founder",
        "talkTitle": "Micro React",
        "talkAbstract": "Full description coming soon. Topics covered include composable and declarative APIs, separation of behavior from display, state machines, and accessibility.",
        "bio": "Ryan is the CEO and co-founder of React Training, a group specializing in in-house workshops and training for React and the extended ecosystem.",
        "headerBio": "Ryan is a prolific web developer, speaker, and educator, and is the co-founder of React Training.",
        "photo": "speaker-ryan.jpg",
        "photoHover": "speaker-ryan-hover.jpg",
        "photoHeader": "speaker-ryan-header.png",
        "video": null,
        "podcast": {
          "src": "https://hwcdn.libsyn.com/p/f/e/e/feebadb3846e9f6e/2020_03_03_JSFundamentalsRyanFlorence.mp3?c_id=66256622&cs_id=66256622&expiration=1583396340&hwt=8bf5d64f650892b3b7a56afc8ae2b58e",
          "isExternal": true,
          "track": "Software Engineering Daily Episodes"
        },
        "twitter": "ryanflorence",
        "github": "ryanflorence",
        "website": "https://reacttraining.com"
      }
    ]
  },
  {
    "mc": [
      {
        "name": "Anjana Vakil",
        "company": "Mapbox",
        "title": "Engineer",
        "talkTitle": "Master of Ceremonies",
        "bio": "Anjana suffers from a debilitating case of curiosity, which led her from philosophy to English teaching to computational linguistics to software development. She can often be found coding in San Francisco; that is, when she's not speaking at events around the world to share the joy of programming and advocate for a more diverse and inclusive tech industry. Ask her about the Recurse Center, Outreachy, and Mozilla TechSpeakers!",
        "headerBio": "Anjana is a prolific engineer, conference speaker, and advocate for Recurse Center, Outreachy, and Mozilla TechSpeakers.",
        "photo": "speaker-anjana.jpg",
        "photoHover": "speaker-anjana-hover.jpg",
        "photoHeader": "speaker-anjana-header.png",
        "video": null,
        "podcast": {
          "src": "anjana-vakil"
        },
        "twitter": "AnjanaVakil",
        "github": "vakila",
        "website": "http://vakila.github.io"
      }
    ]
  }
]
