[
  {
    "speakers": [
      {
        "name": "Theo Browne",
        "company": "Ping.gg",
        "title": "CEO",
        "talkTitle": "The future of React is us",
        "talkAbstract": "From components to JSX to hooks, React has been a beacon of innovation for the web dev world. It didn’t start that way though. When we first saw React’s abstractions in 2012, we were horrified. We eventually were convinced. Now, the roles have reversed. Gatsby, Next and Remix all showed the need for React on the server. It took a bit, but the React team caught on. For the last decade, the community has adopted React’s innovative patterns. This time is different. The innovation of Server Components didn’t come from React. It came from us. In this talk, I’ll be discussing our responsibilities as the new shepherds of React, the React community itself.",
        "bio": "Theo is a strange mix of full stack dev, youtuber, shitposter and CEO. After helping Twitch migrate to React and TypeScript, he started ping.gg. He's known for creating the T3 Stack and pushing the limits of typesafety",
        "headerBio": "",
        "photo": "speaker-theo.jpg",
        "photoHover": "",
        "photoHeader": "",
        "video": null,
        "podcast": null,
        "twitter": "t3dotgg",
        "github": "t3dotgg",
        "website": "https://t3.gg"
      },
      {
        "name": "Nicole Sullivan",
        "company": "Google",
        "title": "Product Manager",
        "talkTitle": "",
        "talkAbstract": "",
        "bio": "Bio coming soon.",
        "headerBio": "",
        "photo": "speaker-nicole.jpg",
        "photoHover": "",
        "photoHeader": "",
        "video": null,
        "podcast": null,
        "twitter": "stubbornella",
        "github": "stubbornella",
        "website": ""
      },
      {
        "name": "Christoph Nakazawa",
        "company": "Stripe",
        "title": "Senior Engineering Manager & Front End Lead",
        "talkTitle": "Game Development with React & the DOM",
        "talkAbstract": "Do easy solutions come at the expense of high performance? In this talk, we'll explore this question as I build a video game from the ground up with JavaScript & React. Along this journey, you'll gain valuable insights into rapid prototyping, test infrastructure, and a range of CSS tricks that can be applied to both game development and your day-to-day work. And perhaps it may even rekindle a love for creating something meaningful & fulfilling, as it did for me!",
        "bio": "Christoph is an experienced engineering manager, frontend lead and aspiring game developer. He has played a key role in the development of tools such as Jest, React Native, Metro, and Yarn while working at companies like Facebook and Stripe. Currently Christoph is exploring game development and optimizing his workflows and is excited to share more in 2023.",
        "headerBio": "Former Meta engineer who contributed to the development of Jest, React Native, Metro, and Yarn",
        "photo": "speaker-christoph.jpg",
        "photoHover": "",
        "photoHeader": "",
        "video": null,
        "podcast": null,
        "twitter": "cpojer",
        "github": "cpojer",
        "website": "https://cpojer.net"
      },
      {
        "name": "Wes Bos",
        "company": "WesBos.com",
        "title": "Engineer & Entrepreneur",
        "talkTitle": "Talk title tbd",
        "talkAbstract": "Talk title tbd",
        "bio": "Wes is a prolific educator, conference speaker, workshop instructor, and co-host of the popular Syntax.fm podcast. He loves creating educational courses on web development. He lives and works in Hamilton, Canada. ",
        "headerBio": "Wes is a prolific educator, conference speaker, workshop instructor, and co-host of the popular Syntax.fm podcast. He loves creating educational courses on web development.",
        "photo": "speaker-wes.jpg",
        "photoHover": "speaker-wes-hover.jpg",
        "photoHeader": "speaker-wes-header.png",
        "video": null,
        "podcast": null,
        "twitter": "wesbos",
        "github": "wesbos",
        "website": "https://www.wesbos.com"
      },
      {
        "name": "David Khourshid",
        "company": "Stately",
        "title": "Founder",
        "talkTitle": "Making state management intelligent",
        "talkAbstract": "talk abstract tbd",
        "bio": "David is a software engineer who loves playing piano and is passionate about animations, state machines, cutting-edge user interfaces, and open-source. Previously at Microsoft, he is now the founder of Stately, a startup focused on making even the most complex application logic visual and accessible to developers and non-developers alike.",
        "headerBio": "Founder, software engineer, & international speaker",
        "photo": "speaker-david.jpg",
        "photoHover": "speaker-david.jpg",
        "photoHeader": "speaker-scott-header.png",
        "video": null,
        "podcast": null,
        "twitter": "davidkpiano",
        "github": "davidkpiano",
        "website": "https://davidk.dev"
      },
      {
        "name": "Colin Sidoti",
        "company": "Clerk",
        "title": "CEO & Co-founder",
        "talkTitle": "Keynote pt 2: A <Component/> is worth a thousand APIs",
        "talkAbstract": "After a decade of REST APIs, developer tools have evolved to speak a new language: React Components. From Next.js's <Image/> to Clerk's <SignIn/>, components have rewritten the rulebook for how much power can be packed into a single line of code. They bundle a frontend with an API, and offer a ridiculously fast, 'lego block' integration experience. But what makes a good component? There is no REST convention to follow, and publishers have landed on dramatically fragmented solutions to challenges like styling, routing, and composability. In this talk, we'll explore the rise of components as the ideal developer tool, and unpack the tradeoffs among these fragmented approaches.",
        "bio": "Colin is co-founder of Clerk, where he helps build authentication and user management tools for React. He has 15 years of frontend experience and is obsessed with making frontend developers more autonomous.",
        "headerBio": "Founder & software engineer",
        "photo": "speaker-colin.jpg",
        "photoHover": "speaker-colin.jpg",
        "photoHeader": "speaker-scott-header.png",
        "video": null,
        "podcast": null,
        "twitter": "",
        "github": "colinclerk",
        "website": "https://clerk.dev"
      },
      {
        "name": "Tanner Linsley",
        "company": "Nozzle.io",
        "title": "Engineer & Owner",
        "talkTitle": "Fireside chat",
        "talkAbstract": "Abstract tbd",
        "bio": "Tanner Linsley has been building software for 10+ years, mostly in the front-end space. He cofounded Nozzle, an SEO analytics SaaS platform, and also created TanStack, his open source umbrella company for web developer tools. He enjoys building open source software, traveling and spoiling his family.",
        "headerBio": "Software engineer, entrepreneur, and proprietor of the Tanstack",
        "photo": "speaker-tanner.jpg",
        "photoHover": "speaker-tanner-hover.jpg",
        "photoHeader": "speaker-tanner-header.png",
        "video": null,
        "podcast": null,
        "twitter": "tannerlinsley",
        "github": "tannerlinsley",
        "website": "https://nozzle.io/"
      },
      {
        "name": "Sunil Pai",
        "company": "Cool Computer Club",
        "title": "Chief",
        "talkTitle": "Talk title tbd",
        "talkAbstract": "Talk abstract tbd",
        "bio": "Sunil builds developer tools for ambitious applications at Cool Computer Club. He's previously been on the React team, worked at companies like Meta, Cloudflare, JP Morgan, Flipkart, and is known for open source libraries like glamor. He can be found playing a blue Les Paul or swimming the neighbourhood pond in London.",
        "headerBio": "Former React Core engineer; Meta & Cloudflare Alum",
        "photo": "speaker-sunil.jpg",
        "photoHover": "speaker-sunil.jpg",
        "photoHeader": "speaker-scott-header.png",
        "video": null,
        "podcast": null,
        "twitter": "threepointone",
        "github": "threepointone",
        "website": "https://www.coolcomputerclub.com/"
      },
      {
        "name": "Jeff Escalante",
        "company": "Independent",
        "title": "Engineering Director",
        "talkTitle": "React Server Components: Beyond the hype",
        "talkAbstract": "React server components (RSC) were initially announced in 2020 and finally made broadly available as a beta via next.js a few months ago. There has been talk and hype around them for years, but genuine understanding of what they are, how they work, and where they shine vs struggle is in short supply. In this talk from the former engineering manager of the next.js team, we'll go into depth on RSC from a balanced perspective, and together we will build a solid understanding of when RSC is the right tool to solve the problems you're facing, and when to look elsewhere. We'll also work through practical examples of RSC in action, and take steps towards shifting your perspective into understanding the new architecture model that RSC sits on top of.",
        "bio": "Jeff has builds web-tooling-oriented software and manages engineering teams doing the same sort of things. Most recently, he was the manager for the next.js team and for part of the react core team at Vercel, and before that led web development at HashiCorp. Outside of work, he runs a small bagel shop and enjoys woodworking, fitness, and playing music.",
        "headerBio": "Jeff has builds web-tooling-oriented software and manages engineering teams doing the same sort of things.",
        "photo": "speaker-jeff.jpg",
        "photoHover": "speaker-jeff.jpg",
        "photoHeader": "speaker-jeff-header.png",
        "video": null,
        "podcast": null,
        "twitter": "jescalan",
        "github": "jescalan",
        "website": "https://resume.jeffescalante.com"
      },
      {
        "name": "Shaundai Person",
        "company": "Netflix",
        "title": "Senior Software Engineer",
        "talkTitle": "Talk title coming soon",
        "talkAbstract": "Abstract coming soon",
        "bio": "Shaundai is a Senior Software Engineer (Netflix) and TC39 Delegate based in Atlanta, GA, US.  She is passionate about making programming interesting and approachable for all, and does that through her work as a course instructor (tsforjs.com), co-lead for React Robins (reactrobins.com), and technical blogger. In her spare time, Shaundai loves to go hiking, jogging, and listen to audiobooks.  Find her on Twitter at @shaundai.",
        "headerBio": "Shaundai is a Senior Software Engineer (Netflix) and TC39 Delegate based in Atlanta",
        "photo": "speaker-jeff.jpg",
        "photoHover": "speaker-jeff.jpg",
        "photoHeader": "speaker-jeff-header.png",
        "video": null,
        "podcast": null,
        "twitter": "shaundai",
        "github": "shaundai",
        "website": "https://linktr.ee/shaundai"
      },
      {
        "name": "Ankita Kulkarni",
        "company": "kulkarniankita.com",
        "title": "Educator, Creator",
        "talkTitle": "Unlocking the Mystery of React's Re-Rendering",
        "talkAbstract": "Your users will not care what tech you used but how fast your app loads. Have you used a hot new stack that everyone loves but still don’t know how to make it performant? Well, it’s because we think about performance as a after-thought after it becomes a bottleneck and when our infra gets costly, ouch! But there is a way to solve this, introducing Core React. We won’t be introducing new tools but going back to how we need to tell React what the DOM should look like. In this talk, we will finally understand why useCallback and useMemo are used, why Lighthouse doesn’t represent performance, how we can minimize component re-render, why it re-renders? and lastly how to profile it with React devtools.",
        "bio": "Ankita is an Educator and teaches courses online or sells digital products, such as her Next.js course or her E-book on transforming devs into engineering leads. She has taught over 10,000 students online. Ankita has architected and scaled many web and mobile apps for clients using React, GraphQL, React Native and Next.js.",
        "headerBio": "Ankita is an Educator and teaches courses online or sells digital products, such as her Next.js course or her E-book on transforming devs into engineering leads. She has taught over 10,000 students online.",
        "photo": "speaker-ankita.jpg",
        "photoHover": "speaker-ankita.jpg",
        "photoHeader": "speaker-ankita-header.png",
        "video": null,
        "podcast": null,
        "twitter": "kulkarniankita9",
        "github": "kulkarniankita",
        "website": "https://kulkarniankita.com"
      },
      {
        "name": "Simon Sturmer",
        "company": "Huddlefire",
        "title": "Software Engineer & Co-founder",
        "talkTitle": "The long-tail of type safety",
        "talkAbstract": "So you've added TypeScript to your codebase, tweaked your tsconfig file and you're flying high with the confidence of no more runtime exceptions and the joy of being able to confidently refactor your code, right? I've been there, it's a great feeling. But as you soon discover, adding TS to your code is only the first step of true end-to-end type safety. In fact, it's likely the easiest step. What about API calls, databases, parsed JSON, query string parameters, request and response bodies, session storage and all those third party libraries and SDKs? These are the I/O boundaries of your application and they can destroy your otherwise flawless type safety. In this talk I'll walk you through the long tail of type safety, approaches to implementing type-safety in the overlooked areas of your stack, and tools to help you do so. You'll come away from this talk well equipped to make your codebase more robust and resilient to runtime exceptions. And best of all you'll get that sweet TypeScript confidence back again!",
        "bio": "Simon is a YC Founder, software engineer, speaker and educator. He's been a frontend engineer at Facebook, worked on product infrastructure at YouTube and is an instructor for Pluralsight Enterprise Learning.",
        "headerBio": "Simon is a YC Founder, software engineer, speaker and educator.",
        "photo": "speaker-simon.jpg",
        "photoHover": "speaker-simon.jpg",
        "photoHeader": "speaker-simon-header.png",
        "video": null,
        "podcast": null,
        "twitter": "sstur_",
        "github": "sstur",
        "website": "sstur.com"
      },
      {
        "name": "Andre Landgraf",
        "company": "LinkedIn",
        "title": "Software Engineer",
        "talkTitle": "The time to go full stack is now",
        "talkAbstract": "Do you currently feel stuck working on a React SPA? Is the performance declining? Then it's time to sit down with the decision-makers at your company and convince them to unlock the full potential of the web platform. It is 2023, and the JavaScript ecosystem has never been stronger. In this talk, I want to make 7 points to convince your boss to go full stack. Only with access to the full stack of the web platform will you be able to tackle the performance requirements of tomorrow. You might have already fallen in love with the idea of owning the backend of the web platform, but you will need a business case with solid business incentives to make your boss pay attention. Let’s build one together!",
        "bio": "Andre is a developer from Germany who is passionate about all things web. He previously worked on voice apps at Mercedes-Benz R&D before joining LinkedIn. In his free time, he tutors aspiring developers in weekly meetups and writes about full-stack development.",
        "headerBio": "Andre is a developer from Germany who is passionate about all things web.",
        "photo": "speaker-andre.jpg",
        "photoHover": "speaker-andre.jpg",
        "photoHeader": "speaker-andre-header.png",
        "video": null,
        "podcast": null,
        "twitter": "AndreLandgraf94",
        "github": "andrelandgraf",
        "website": "https://andre-landgraf.cool"
      },
      {
        "name": "Henrique Inonhe",
        "company": "Codeminer42",
        "title": "Software Engineer",
        "talkTitle": "Concurrent React Made Easy",
        "talkAbstract": "UI’s are composed of fast parts, and slow parts in terms of how responsive they are to user interaction. React's concurrent renderer decouples the fast parts from the slow parts by allowing us to render the slow parts in the background without blocking the fast parts, so that each part can respond to user interaction at its own pace. In this talk, we'll explore Concurrent React, understand what problems it solves, how it works and how to leverage it through the use of concurrent features.",
        "bio": "Henrique Inonhe is a Musician and Audio Engineer turned software developer. He currently works mostly with Javascript and is a static type maniac.",
        "headerBio": "Henrique Inonhe is a Musician and Audio Engineer turned software developer.",
        "photo": "speaker-henrique.jpg",
        "photoHover": "speaker-henrique.jpg",
        "photoHeader": "speaker-henrique-header.png",
        "video": null,
        "podcast": null,
        "twitter": "HInonhe",
        "github": "henriqueinonhe",
        "website": "https://github.com/henriqueinonhe"
      },
      {
        "name": "Fred Schott",
        "company": "Astro",
        "title": "Co-founder & CEO",
        "talkTitle": "Panel: Server Component Solutions from the community",
        "talkAbstract": "This panel will explore the community-driven solutions on server components. Shruti Kapoor will sit down with Tanner Linsley from the Tanstack, Fred Schott from Astro, and Ryan Carniato from Solid.js to discuss their approaches to server components. Topics covered may include: When & how do these library maintainers integrate, or recommend, server-side rendering in their architectural framing? How does it differ from the React core team's approach, and what does that tell us? What is their long-term vision and/or plan for server components? Footguns, latest innovations, lessons learned from the past and from each other, etc.",
        "bio": "Fred is the cofounder and CEO of Astro, and the founder of Skypack, a next-gen CDN for JavaScript and modern web development. Fred also created Snowpack, a modern build tool for web developers that leverages new JavaScript features to speed up traditional development workflows by 10x or more. Fred lives with his wife in Oakland, CA. He has spent the last 8 years working in JavaScript and Open Source Software at companies like Box, Google, and Ripple.",
        "headerBio": "Fred is the cofounder and CEO of Astro, and the founder of Skypack, a next-gen CDN for JavaScript and modern web development.",
        "photo": "speaker-fred.jpg",
        "photoHover": "speaker-fred.jpg",
        "photoHeader": "speaker-fred-header.png",
        "video": null,
        "podcast": null,
        "twitter": "FredKSchott",
        "github": "fredkschott",
        "website": "https://github.com/fredkschott"
      },
      {
        "name": "Ryan Carniato",
        "company": "Netlify",
        "title": "OSS Engineer",
        "talkTitle": "Panel: Server Component Solutions from the community",
        "talkAbstract": "This panel will explore the community-driven solutions on server components. Shruti Kapoor will sit down with Tanner Linsley from the Tanstack, Fred Schott from Astro, and Ryan Carniato from Solid.js to discuss their approaches to server components. Topics covered may include: When & how do these library maintainers integrate, or recommend, server-side rendering in their architectural framing? How does it differ from the React core team's approach, and what does that tell us? What is their long-term vision and/or plan for server components? Footguns, latest innovations, lessons learned from the past and from each other, etc. ",
        "bio": "As a JavaScript performance enthusiast, and fine-grained reactivity super-fan, Ryan is obsessively passionate about the future of JavaScript frameworks. He is the creator of SolidJS, and a maintainer of Marko.",
        "headerBio": "Creator of SolidJS, and a maintainer of Marko.",
        "photo": "speaker-ryan.jpg",
        "photoHover": "speaker-ryan.jpg",
        "photoHeader": "speaker-ryan-header.png",
        "video": null,
        "podcast": null,
        "twitter": "RyanCarniato",
        "github": "ryansolid",
        "website": "https://dev.to/ryansolid"
      }
    ]
  },
  {
    "mc": [
    ]
  }
]
