[
  {
    "speakers": [
      {
        "name": "Simona Cotin",
        "company": "Azure Static Apps",
        "title": "Product",
        "talkTitle": "Keynote - Serverless in the Park",
        "talkAbstract": "Abstract coming soon",
        "bio": "Simona Cotin is a web developer with a passion for teaching. She spends most of her time tinkering with JavaScript in the cloud and sharing her experience with other developers. As a Cloud Developer Advocate, Simona engages with the web community to help create a great developer experience with Azure. She loves shipping code to production and has built network data analytics platforms using Angular, Typescript, React, and Node.js.",
        "headerBio": "Product at Azure",
        "photo": "speaker-simona.jpg",
        "photoHover": "speaker-simona.jpg",
        "photoHeader": "speaker-ryan-header.png",
        "video": null,
        "podcast": null,
        "twitter": "simona_cotin",
        "github": "simonaco",
        "website": "https://azure.microsoft.com/en-us/services/app-service/static/"
      },
      {
        "name": "Matt Biilmann",
        "company": "Netlify",
        "title": "CEO & Co-founder",
        "talkTitle": "The Future of Jamstack & Serverless",
        "talkAbstract": "Abstract coming soon",
        "bio": "Mathias (Matt) Biilmann is CEO of Netlify, a company he co-founded in 2014 and today is one of the fastest-growing web development platforms. Matt originated the term “Jamstack” in 2015, a new approach to building faster, more secure web applications, which has spawned a large global community and movement. Matt is an entrepreneur and lifelong developer with 30+ years of experience contributing production code in more than a dozen languages at all layers of the stack, including numerous open source projects. Before founding Netlify, Matt created its predecessor called BitBalloon, and earlier founded Webpop, a hosted CMS platform for agencies that build websites. Prior to that, he was CTO at Domestika, where he onboarded tens of thousands of small and medium businesses online. Later, he helped manage and grow its Creative Community and learning platform to more than 2 million members. Throughout his career, he built and maintained tens of thousands of large-scale websites across Europe, which informed his approach to developing for the web. Matt grew up in Denmark, where he trained as a musician and music journalist. His passion for music combined with his education in comparative literature and Master’s in cultural studies informs his approach to designing software with humans in mind.",
        "headerBio": "The CEO & co-founder of Netlify, Matt is responsible for coining the term Jamstack along with his co-founder of Netlify, Chris Bach.",
        "photo": "speaker-matt.jpg",
        "photoHover": "speaker-jenn-hover.jpg",
        "photoHeader": "speaker-jenn-header.png",
        "video": null,
        "podcast": null,
        "twitter": "biilmann",
        "github": "biilmann",
        "website": "https://netlify.com"
      },
      {
        "name": "Jeremy Daly",
        "company": "Serverless",
        "title": "GM of Serverless Cloud",
        "talkTitle": "The Future of Jamstack & Serverless",
        "talkAbstract": "Abstract coming soon",
        "bio": "Jeremy is a passionate serverless advocate, an AWS Serverless Hero, and a senior technology leader with more than 20 years of experience building web and mobile applications. He is an active member of the serverless community, creating and contributing to open source serverless projects, and frequently consulting with companies looking to adopt serverless. Jeremy also writes extensively about serverless on his blog (jeremydaly.com), publishes Off-by-none, a weekly email newsletter that focuses on all things serverless (offbynone.io), and hosts the Serverless Chats Podcast (serverlesschats.com). He is currently the GM of Serverless Cloud at Serverless, Inc.",
        "headerBio": "Host of the Serverless Chats Podcast, Jeremy is a leader in the Serverless community with over 20 years of building web & mobile applications.",
        "photo": "speaker-jeremy.jpg",
        "photoHover": "speaker-jeremy.jpg",
        "photoHeader": "speaker-guillermo-header.png",
        "video": null,
        "podcast": null,
        "twitter": "jeremy_daly",
        "github": "jeremydaly",
        "website": "https://www.serverlesschats.com/"
      },
      {
        "name": "Farrah Campbell",
        "company": "AWS",
        "title": "Sr. Product Marketing Manager – Modern Applications, AWS",
        "talkTitle": "I built a Serverless Backend and you can too",
        "talkAbstract": "Using Serverless reduces time spent managing infrastructure and provides developers more time to focus on code. In this session, I will talk about why front end developers should care about serverless and how it gives front end-focused teams the superpower to build a scalable back end for their applications without all the overhead of managing infrastructures. Along the way we will discuss pitfalls and best practices to help you get a jump start on developing without servers.",
        "bio": "After 10 years of working in healthcare management, a serendipitous 20-minute car ride with Kara Swisher inspired Farrah to make the jump into technology. She has worked at multiple startups in many different capacities, eventually working her way to being a Sr. Product Marketing Manager at AWS focused on Modern Applications. She is known for not only her ability to get things done but her track-record of accomplishing lofty goals in creative, dynamic ways with an infectious smile. Her passion lies in influencing outcomes and driving projects with multiple stakeholders, priorities, and personalities towards a common goal. She will be the first to tell you how much she loves the chaos and challenges that tech provides. Farrah has shaped a unique story and career that supports her passion for fostering genuine, vibrant communities. She aims to re-define the experience of “providing a service” with a no bs attitude and lots of compassion.",
        "headerBio": "International speaker & serverless expert at AWS",
        "photo": "speaker-farrah.jpg",
        "photoHover": "speaker-farrah.jpg",
        "photoHeader": "speaker-naomi-header.png",
        "video": null,
        "podcast": null,
        "twitter": "farrahc32",
        "github": "Farrah32",
        "website": "https://farrahcampbell.com/"
      },
      {
        "name": "Brian Leroux",
        "company": "Begin.com",
        "title": "CTO & Co-founder",
        "talkTitle": "The Future of Jamstack & Serverless",
        "talkAbstract": "Panel abstract coming soon",
        "bio": "Brian is the co-founder and CTO of Begin.com, the fastest and easiest way to setup CI/CD gitops for serverless web apps on AWS. He is the creator and maintainer of OpenJS Architect, an open-source framework for generating and deploying AWS standard SAM/CloudFormation and coined the term FASTstack. He has been keeping a close eye on Deno since its earliest moments and is already using it in production today. You can catch him @brianleroux on Twitter where he talks about open source, JavaScript, serverless, faststack, Deno, and other developer-related stuff.",
        "headerBio": "Brian is a Serverless expert and the co-founder and CTO of Begin.com, a platform for building and deploying modern web apps, sites, and APIs.",
        "photo": "speaker-brian.jpg",
        "photoHover": "speaker-brian.jpg",
        "photoHeader": "speaker-brian-header.png",
        "video": null,
        "podcast": null,
        "twitter": "brianleroux",
        "github": "brianleroux",
        "website": "https://begin.com"
      },
      {
        "name": "Rob Sutter",
        "company": "Fauna",
        "title": "Head of Developer Advocay",
        "talkTitle": "Building data-driven APIs at the edge",
        "talkAbstract": "Talk abstract coming soon",
        "bio": "Rob has woven application development into his entire career, from time in the U.S. Army and U.S. Government to stints with the Big Four and Amazon Web Services. He has started his own company – twice – most recently with WorkFone, a SaaS startup that provided virtual digital identities to government clients. Rob loves to build in public with all things serverless!",
        "headerBio": "Serverless expert & international speaker at Fauna, previously AWS",
        "photo": "speaker-rob.jpg",
        "photoHover": "speaker-rob.jpg",
        "photoHeader": "speaker-brian-header.png",
        "video": null,
        "podcast": null,
        "twitter": "rts_rob",
        "github": "rts-rob",
        "website": "https://robsutter.com/"
      },
      {
        "name": "Kristi Perreault",
        "company": "Liberty Mutual",
        "title": "Senior Software Engineer",
        "talkTitle": "What I Have Learned Scaling Serverless First at Liberty Mutual",
        "talkAbstract": "Serverless first is a growing initiative, but what exactly does this look like in enterprise? How do we scale serverless for thousands of developers? As a sr software engineer for serverless enablement, I will share my unique perspective on how to get started with a serverless team. I will discuss what worked well for us, including pattern development, our support model, enabling constraints, building a serverless community, and educating our tech leads. We will review what could be improved, including day 2 pattern usage, cloud education & experimentation, resource provisioning, and gaining buy in from tech leaders. Lastly, attendees will get a glimpse of what's to come, and where we're headed next.",
        "bio": "Kristi Perreault is a Senior Software Engineer at Liberty Mutual Insurance, where her focus is serverless development and enablement. She has over 4 years of industry experience, holds an M.S. in Electrical & Computer Engineering, and is very passionate about promoting women in technology. Outside of work and the serverless tech space, Kristi can be found in the mountains of Colorado hiking, mountain biking, skiing, golfing, or doing just about anything else outdoors.",
        "headerBio": "Senior software engineer focusing on serverless development & enablement",
        "photo": "speaker-kristi.jpg",
        "photoHover": "speaker-kristi.jpg",
        "photoHeader": "speaker-brian-header.png",
        "video": null,
        "podcast": null,
        "twitter": "kperreault95",
        "github": "kristiperreault",
        "website": "https://kristiperreault.medium.com/"
      },
      {
        "name": "Erik Rasmussen",
        "company": "Centered.app",
        "title": "Senior Frontend Engineer",
        "talkTitle": "State machines on the edge",
        "talkAbstract": "Modeling business logic with state machines has numerous benefits, from eliminating bugs caused by impossible states to visualizing the logic to communicate with non-technical shareholders to simply communicating user flow between technical colleagues. In this talk, I'm going to demonstrate, via live coding, how to combine the strengths of Remix and XState to create a checkout flow entirely on the backend. No. JavaScript. Required.",
        "bio": "Erik is an American expat in Spain and author of Redux Form and React Final Form. He's currently obsessed with XState, Remix, and building the best productivity app for developers at Centered.",
        "headerBio": "Software engineer & creator of Redux Form & React Final Form",
        "photo": "speaker-erik.jpg",
        "photoHover": "speaker-erik.jpg",
        "photoHeader": "speaker-brian-header.png",
        "video": null,
        "podcast": null,
        "twitter": "erikras",
        "github": "erikras",
        "website": "https://erikras.com/"
      },
      {
        "name": "Tejas Kumar",
        "company": "Xata",
        "title": "Director of Developer Relations",
        "talkTitle": "Building a Massively Scalable and Performant Jamstack App in Minutes",
        "talkAbstract": "Thanks to the incredible amount of developer tooling available today, building apps has been simplified with tools like `npx create`–but how do we scale them on the Jamstack? This talk explores technologies that enable massive scale while allowing us to focus on the apps themselves without getting distracted by replication.",
        "bio": "Tejas has been writing code since age 8 and public speaking since age 19. Today, 20 years since 'Hello world', Tejas enjoys sharing knowledge among developer communities.",
        "headerBio": "International speaker & software engineer",
        "photo": "speaker-tejas.jpg",
        "photoHover": "speaker-tejas.jpg",
        "photoHeader": "speaker-scott-header.png",
        "video": null,
        "podcast": null,
        "twitter": "tejaskumar_",
        "github": "TejasQ",
        "website": "https://tej.as/"
      }
    ]
  },
  {
    "mc": []
  }
]
