[
  {
    "time": "8:30am",
    "speaker": null,
    "talkTitle": "Check-in & Coffee",
    "talkDescription": null,
    "photo": null,
    "speakerBio": null,
    "tableRowExpands": false
  },
  {
    "time": "10:00am",
    "speaker": "Brian Douglas, Netlify",
    "talkTitle": "Welcome + Reasons React was created",
    "talkDescription": "React revolutionized the way we build modern user interfaces. But before it took off, it was built to solve a few key problems when building apps for the web. In this short talk, we'll learn what those problems were and how React approached solving them.",
    "photo": "brian-douglas",
    "speakerBio": "Brian is a developer at Netlify (https://www.netlify.com), where he was first hired to convert their Angular app to React. Since then he has been working heavily on multiple React apps using Redux, GraphQL/Apollo, and a variety of solutions for styling. In his spare time, he mentors new programmers towards contributing in open source as well as JavaScript and React tools.",
    "tableRowExpands": true
  },
  {
    "time": "10:15",
    "speaker": "Ben Ilegbodu, Eventbrite",
    "talkTitle": "Why React?",
    "talkDescription": "As the Frontend Platform team at Eventbrite switched from Backbone/Marionette over to React, it had to convince other developers, managers, directors, and non-engineers that React was the right path. And the rationale for moving wasn’t just because React is insanely popular. There are many tangible benefits that make the effort of migrating worthwhile. New to React and want to learn a little about how it works? Seeking ammunition to convince your team to make the change? Come learn about why we made the decision to transition to React, through an introduction of how to build user interactions with React.",
    "photo": "ben-ilegbodu",
    "speakerBio": "Ben is a Christian, a husband and a father of 2 with 10+ years of experience developing user interfaces for the Web. He currently leads and manages Eventbrite’s Frontend Platform team. On the side, Ben also enjoys playing basketball, DIY, watching movies, and blogging. He blogs at (benmvp.com) and tweets (@benmvp) about his experiences with new web technologies.",
    "tableRowExpands": true
  },
  {
    "time": "11:00",
    "speaker": "Jay Phelps, Netflix",
    "talkTitle": "Why I love JSX!",
    "talkDescription": "JSX is an XML-like syntax extension to JavaScript, popularized by React. When seen for the first time it can often elicit bad memories of intermixing HTML and code, but JSX is *very* different! Let's learn exactly what it is, how it works, and even how you can use it outside of React.",
    "photo": "jay-phelps",
    "speakerBio": "Reactive programming nut and compiler enthusiast. Jay is a Senior Software Engineer at Netflix. Lover of all things open source, his contributions span numerous ecosystems. Former RxJS core team member and author of core-decorators, git-blame-someone-else, and co-author of redux-observable.",
    "tableRowExpands": true
  },
  {
    "time": "11:20",
    "speaker": "Feather Knee, Nvidia",
    "talkTitle": "From Imperative to Declarative",
    "talkDescription": "There are often many ways to solve the same problem. This talk explores two different approaches, imperative and declarative. We will look at code samples and discuss the relative merits of each, starting with vanilla JS then moving to more concrete examples in JSX.",
    "photo": "feather-knee",
    "speakerBio": "Feather started her career at Accenture as a technical consultant in various Silicon Valley companies including Sun Microsystems, Robert Half, and Electronic Arts. She went on to work as a Java developer for various startups that didn’t survive the first dot.com meltdown. After this she left the tech world to have a career as a working artist for several years. She returned to teach a web development bootcamp in both NYC and SF for General Assembly. She then went on to work as a full stack developer at Netflix for the next few years, and is now a front end developer at Nvidia. She lives in San Jose with her partner and the cutest dog on earth.",
    "tableRowExpands": true
  },
  {
    "time": "11:45",
    "speaker": null,
    "talkTitle": "Lunch",
    "talkDescription": null,
    "photo": null,
    "speakerBio": null,
    "tableRowExpands": false
  },
  {
    "time": "12:40pm",
    "speaker": "Joe Seifi, Eventbrite",
    "talkTitle": "CSS in React",
    "talkDescription": "React has no standard way to style components. A slew of ideas and frameworks have grown out of the community. But, with so many CSS in JS solutions, how do you know which one to choose? In this talk, I will cover five different ways to style your React projects, and the pros and cons of each approach. From CSS Modules with SASS to Styled Components, you’ll learn how each library works so that you know which one(s) best fits your needs.",
    "photo": "joe-seifi",
    "speakerBio": "Joe Seifi is a senior software engineer at Eventbrite in San Francisco. Previously he worked at Trulia, Apple, and Disney on various web projects.",
    "tableRowExpands": true
  },
  {
    "time": "1:15",
    "speaker": "Rachel Ralston, Wells Fargo",
    "talkTitle": "Testing your React Components with Jest",
    "talkDescription": "Jest was created by Facebook and is a testing framework to test javascript and React code. It's the de facto unit testing framework for ReactJS project. In this workshop, we'll go over the basics of Jest, what makes it such a powerful tool in React projects, and when you should be using it.",
    "photo": "rachel-ralston",
    "speakerBio": "Rachel is an artist-turned-engineer & blockchain nerd working as a React engineer at Wells Fargo. She lives in Oakland where she’s a co-founder with the Oakland Blockchain Developers, a grassroots organizing teaching practical blockchain engineering skills, and upon occasion she leaves her computer screen long enough to go hiking with her dog.",
    "tableRowExpands": true
  },
  {
    "time": "1:30",
    "speaker": "Swizec Teller, Yup Technologies",
    "talkTitle": "Dataviz with React + D3",
    "talkDescription": "React can make your D3 amazing. Want to animate 20,000 elements with React? I'll show you. Want to build a complex dataviz? You'll know how. Want to write maintainable dataviz components that you can reuse in any project? I gotchu, fam. This talk shows you everything I've learned about creating reusable  and maintainable graphical components over 3 years of hammering away at the question: 'Jeez D3 sure is hard to learn, how do we make this easier?'",
    "photo": "swizec-teller",
    "speakerBio": "Hi I'm Swizec, a geek with a hat. Rumor has it my bird is more popular these days than my hat 🤔 I’ve made some books and courses on web development and working on more. Been doing JavaScript since before jQuery was cool and building my first React component back in 2015 blew my mind.",
    "tableRowExpands": true
  },
  {
    "time": "2:00",
    "speaker": null,
    "talkTitle": "Break",
    "talkDescription": null,
    "photo": null,
    "speakerBio": null,
    "tableRowExpands": false
  },
  {
    "time": "2:20",
    "speaker": "Mark Erikson, Northrop Grumman",
    "talkTitle": "The Fundamentals of Redux",
    "talkDescription": "Redux is the most widely-used state management library for React applications, and has spread throughout the Javascript ecosystem. However, the learning curve can be steep for many people. Come join Redux co-maintainer Mark Erikson as we talk about the core concepts of Redux, how to use Redux with React, and how Redux was designed to make Javascript applications predictable.",
    "photo": "mark-erikson",
    "speakerBio": "Mark is a software engineer living in southwest Ohio, USA, where he patiently awaits the annual heartbreak from the Reds and the Bengals. Mark is a Redux maintainer, author of the Redux FAQ, maintains the React/Redux Links list and Redux Addons Catalog, tweets at @acemarke, and blogs at http://blog.isquaredsoftware.com. He can be usually found in the Reactiflux chat channels, answering questions about React and Redux.",
    "tableRowExpands": true
  },
  {
    "time": "3:00",
    "speaker": "Harry Tormey, Launchdrawer",
    "talkTitle": "An iOS Developer's Opinion of React Native",
    "talkDescription": "The promise of writing code for iOS and having it “just work” out of the box on Android is a tempting one. That along with hot reloading code and the ability to push over the air updates to published apps make React Native a tempting proposition. This sounds too good to be true so what’s the catch? React Native is a framework for building native apps using Javascript. Many native developers rightly associate hybrid Javascript apps with disappointing consumer experiences and frustrating development environments. Over the years the same promises have been made by many other Javascript based frameworks, so why is React Native any different? This talk will be from the perspective of an experienced iOS developer who has been working with React Native for the last 2 years and has shipped several cross platform apps with it.",
    "photo": "harry-tormey",
    "speakerBio": "Harry is an iOS developer who is very enthusiastic about React Native. Currently he works as a mobile contractor with various companies. In the past he’s worked as a Software Engineer at Facebook, Apple and a number of startups you've probably never heard of.",
    "tableRowExpands": true
  },
  {
    "time": "3:35",
    "speaker": null,
    "talkTitle": "Break",
    "talkDescription": null,
    "photo": null,
    "speakerBio": null,
    "tableRowExpands": false
  },
  {
    "time": "4:00",
    "speaker": "Kyle Mathews, Gatsby.js",
    "talkTitle": "The Client-Side Revolution, Brought to You by React",
    "talkDescription": "Building websites has changed dramatically over the last few years. In this session we’ll go on a history trip to discover where we came from, why React is a such a big deal, and where we might be going soon. We’ll discuss what a website is and why we use the tools we do to build them and how this is the best of all times to be building for the web.",
    "photo": "kyle-mathews",
    "speakerBio": "Kyle is a tech entrepreneur based in San Francisco, CA. He's founded several startups and is now helping build a next generation open source JavaScript website framework called Gatsby that blends the speed and simplicity of static sites with the rich tooling and client-side capabilities of React.js.",
    "tableRowExpands": true
  },
  {
    "time": "4:22",
    "speaker": "David Wells, Serverless",
    "talkTitle": "Why Serverless Architecture is Changing Software Development",
    "talkDescription": "The 'Serverless Architecture' has become massively popular this year, and for the right reasons. It’s zero-administration nature and pay-per-execution pricing model enable developers to manage less infrastructure and build more than ever. So what are developers actually building with it? David will explore different use cases for building microservices with Serverless technology. The talk will include real world serverless examples from companies & the open source world.",
    "photo": "david-wells",
    "speakerBio": "David Wells is a full stack developer at Serverless, Inc. in San Francisco. He is passionate about developer experience and creating products that are powerful and easy to use. His previous roles include lead UI/UX developer at Mulesoft and founder of Inbound Now, an open source marketing software platform. He specialized in Full stack JavaScript, HTML, CSS, Marketing, & UI/ UX.",
    "tableRowExpands": true
  },
  {
    "time": "4:40",
    "speaker": "Matt Biilmann, Netlify",
    "talkTitle": "React and the JAMstack",
    "talkDescription": "Abstract coming soon",
    "photo": "matt-biilmann",
    "speakerBio": "Matt is regarded as one of the driving forces behind the resurgence of static websites and is a founder at Netlify, the fastest growing automation platform for modern websites. Matt has lead the development of all of 3 commercial CMS (swears he won’t do a fourth), has written production code in more than a dozen programming languages, is trilingual and enjoys listening to beer and drinking modern jazz.",
    "tableRowExpands": true
  },
  {
    "time": "5:00",
    "speaker": "Brian Douglas, Netlify",
    "talkTitle": "Closing Words",
    "talkDescription": null,
    "photo": "brian-douglas",
    "speakerBio": "Brian is a developer at Netlify (https://www.netlify.com), where he was first hired to convert their Angular app to React. Since then he has been working heavily on multiple React apps using Redux, GraphQL/Apollo, and a variety of solutions for styling. In his spare time, he mentors new programmers towards contributing in open source as well as JavaScript and React tools.",
    "tableRowExpands": true
  },
  {
    "time": "5:30",
    "speaker": null,
    "talkTitle": "Venue doors close",
    "talkDescription": null,
    "photo": null,
    "speakerBio": null,
    "tableRowExpands": false
  }
]
