{
  "hiringMixer": {
    "title": "Jobs from our Sponsors",
    "date": "December 18",
    "time": "Rolling Admission",
    "subtext": "Our sponsors are not only on the cutting edge of web development -- they also provide unique and interesting solutions to various problems in our society. Join one of the teams from our sponsors to change the world for the better.",
    "contactInfo": {
      "placeholder": "#HIRING_MANAGER_CONTACT#",
      "href": "mailto:sponsors@reactathon.com",
      "text": "sponsors@reactathon.com"
    },
    "buttonText": "Register Free",
    "buttonHref": "https://www.eventbrite.com/e/remote-hiring-mixer-reactathon-2020-online-worldwide-tickets-130356944129"
  },
  "jobListings": {
    "noJobsTitle": "Job Listings Coming Soon",
    "noJobsSubtext": "Many of our sponsors are hiring. Their job listings will show up here in the next few weeks.",
    "jobsTitle": "",
    "jobs": [{
      "company": "Vercel",
      "title": "Senior Full Stack Engineer, AMER",
      "location": "US, Canada",
      "description": "At Vercel, we are building an open-source developer tools platform that enables developers to build and iterate on the web without sinking time and money into DevOps. In this role you will be responsible for the overall development of software applications. Your responsibilities will include designing system architecture to high-level programming, performance testing, and system integration.",
      "remote": true,
      "logo": "",
      "link": "https://vercel.com/careers/senior-full-stack-engineer-amer"
    }, {
      "company": "Vercel",
      "title": "Senior Full Stack Engineer, EMEA",
      "location": "UK, Ireland, Netherlands, Germany",
      "description": "At Vercel, we are building an open-source developer tools platform that enables developers to build and iterate on the web without sinking time and money into DevOps. In this role you will be responsible for the overall development of software applications. Your responsibilities will include designing system architecture to high-level programming, performance testing, and system integration.",
      "remote": true,
      "logo": "",
      "link": "https://vercel.com/careers/senior-full-stack-engineer-emea"
    }, {
      "company": "Vercel",
      "title": "Senior Product Designer",
      "location": "US, Canada, UK, Ireland, Netherlands, Germany",
      "description": "At Vercel, we are building an open-source developer tools platform that enables developers to build and iterate on the web without sinking time and money into DevOps. Vercel is looking for a Senior Product Designer to join our team. In this role, you'll work across the product designing system based solutions for helping the team build remarkable software interfaces.",
      "remote": true,
      "logo": "",
      "link": "https://vercel.com/careers/senior-product-designer-amer"
    }, {
      "company": "Hasura",
      "title": "Senior Frontend Engineer",
      "location": "Anywhere",
      "description": "Hasura.io is looking for a Senior Frontend Engineer to join the console team. The Hasura console is the most critical user-facing component for developers and teams using Hasura and is like an IDE for Hasura. The Hasura console is a large and complex codebase and as a frontend engineer, your responsibilities will also include improving the developer experience for developers so that they can build features easily and move faster.",
      "remote": true,
      "logo": "",
      "link": "https://hasura.io/careers/?jobId=FodayB5mapv_"
    }, {
      "company": "Hasura",
      "title": "Manager - GraphQL Engine",
      "location": "Anywhere",
      "description": "Hasura.io is looking for an experienced Engineering Manager to lead the team building the Hasura GraphQL Engine. We build tools for developers to lessen the effort that goes into building backends for applications. The Hasura GraphQL Engine gives developers a real-time GraphQL backend on top of existing databases (Postgres, MS SQL, BigQuery)",
      "remote": true,
      "logo": "",
      "link": "https://hasura.io/careers/?jobId=QwMKFhPpqeHi"
    }, {
      "company": "Auth0",
      "title": "Auth0 Senior Software Engineering, Core Pipeline",
      "location": "Remote",
      "description": "This role is for you if you like being at the center of the action, it’s for you if you like to help people to grow and if you like solving non-trivial problems, transforming them into smaller easier problems. IAM Core is the Engineering Domain that takes care of the core of the Auth0 application: the authentication pipeline, the protocols, the sessions, anomaly detection and customer security detection and response mechanisms.",
      "remote": true,
      "logo": "",
      "link": "https://www.okta.com/company/careers/engineering/auth0-senior-software-engineering-core-pipeline-3625727/"
    }, {
      "company": "Course Hero",
      "title": "Senior Software Engineer - Front End",
      "location": "SF Bay Area, Vancouver, and Toronto",
      "description": "Course Hero is scaling! We're looking for a Senior Software Engineer to drive key projects, mentor team members, deal with constantly evolving business needs, and help continuously improve our software systems. You'll own the effort to build many of our front-end applications serving students, educators, and tutors. We're big on Typescript/ React/ Tailwind/ Go and experimenting (with products in production!) with React-Native & GraphQL.",
      "remote": true,
      "logo": "",
      "link": "https://grnh.se/6bfce3d31us"
    }]
  }
}
