{
  "section": {
    "h2Slab": "Topic Tables",
    "p1": "A gathering place where engineers test & expand their knowledge of a subject through discussion, moderated by experts. Easily identify the subjects you want to discuss and learn about, & meet with friends old & new to make your conference experience even better.",
    "date": "May 3",
    "time": "7:30pm - 9:00pm",
    "bullets": [
      "Takes place following the opening keynote",
      "Easily identify the subjects you care about",
      "Break the ice with other attendees, speakers, and workshop instructors",
      "Engage in conversation or listen to others discuss",
      "Make new friends & improve your conference experience"
    ],
    "h3Slab": "Topics & Moderators coming soon"
  },
  "topics": [
    {
      "name": "Suspense",
      "description": "React 16.6 added a <Suspense> component that lets you “wait” for some code to load and declaratively specify a loading state (like a spinner) while we’re waiting. Suspense for Data Fetching is a new feature that lets you also use <Suspense> to declaratively “wait” for anything else, including data.",
      "img": "/about/topic-tables/suspense.svg",
      "managers": [
        {
          "name": "Michael Chan",
          "title": "DX Community Engineer",
          "company": "Chromatic",
          "bio": "Michael Chan loves the web. He's the host of React Podcast. And he's building Lunch Dev, the friendliest coding community for creative, curious, and compassionate web developers.",
          "img": "/speakers/speaker-michael.jpg"
        }
      ]
    },
    {
      "name": "React 18",
      "description": "The latest major version of React includes out-of-the-box improvements like automatic batching, new APIs like startTransition, and streaming server-side rendering with support for Suspense, and many more features. Come chat with Andrew Clark of Meta from the React Core Team to learn more!",
      "img": "/about/topic-tables/react-18.svg",
      "managers": [
        {
          "name": "Andrew Clark",
          "title": "Software Engineer",
          "company": "Meta",
          "bio": "Andrew Clark is a member of the React team. He got started with web development by making sites with WordPress, and eventually tricked himself into doing JavaScript. His favorite pastime is karaoke. Andrew is either a Disney villain or a Disney princess, depending on the day.",
          "img": "/speakers/speaker-andrew.jpg"
        },
        {
          "name": "Shruti Kapoor",
          "title": "Staff Engineer",
          "company": "Paypal",
          "bio": "Shruti is a Staff Engineer at PayPal and is passionate about teaching and sharing knowledge on JavaScript, React, GraphQL and front-end technologies. She shares byte sized javascript tidbits through her newsletter - JSByte: http://tinyletter.com/shrutikapoor. She is also an ardent #DevJoke fan",
          "img": "/speakers/speaker-shruti.jpg"
        }
      ]
    },
    {
      "name": "React Native",
      "description": "With React Native, React primitives render to the native platform UI, meaning your app uses the same native platform APIs as other native apps. You can write for many platforms with similar React code by creating platform-specific versions of components, so a single codebase can share code across platforms. With React Native, one team can maintain two platforms and share a common technology—React.",
      "img": "/about/topic-tables/react-native.svg",
      "managers": [
        {
          "name": "Gant Laborde",
          "title": "Chief Innovation Officer",
          "company": "Infinite Red",
          "bio": "Gant Laborde is an owner of Infinite Red, mentor, adjunct professor, published author, and award-winning speaker. For 20 years, he has been involved in software development and continues strong today. He is recognized as a Google Developer Expert in Web and Machine Learning, but informally he is an “open sourcerer” and aspires to one day become a mad scientist. He blogs, videos, and maintains popular repositories for the community. Follow Gant’s adventures at https://gantlaborde.com/",
          "img": "/speakers/speaker-gant.jpg"
        },
        {
          "name": "Jamon Holmgren",
          "title": "Founder & CTO",
          "company": "Infinite Red",
          "bio": "Jamon is a software developer, business owner, husband, and father of four, located near Portland, Oregon, in SW Washington state. He is one of the co-founders of Infinite Red, Inc., a fully remote React Native app development studio located across the USA and Canada. He learned to code at age twelve in order to make games (the game store was too far away from where he grew up) and that led to a lifelong obsession with coding. He is active in open source, plays ice hockey on a Finnish-American team, and takes any excuse to use his tractor that he can.",
          "img": "/speakers/speaker-jamon.jpg"
        }
      ]
    },
    {
      "name": "Edge Deployments",
      "description": "The landscape of the web has evolved drastically since the first website was published to the World Wide Web in 1991. Over the years, the pendulum has swung from servers rendering HTML to JavaScript-heavy clients and now it's swinging toward something more in the middle.What about the web today is enabling us to overcome the shortcomings of the web of the past? Come chat with and learn about Edge with Kent C. Dodds following his opening keynote!",
      "img": "/about/topic-tables/concurrent-mode.svg",
      "managers": [
        {
          "name": "Kent C. Dodds",
          "title": "Director of Developer Experience",
          "company": "Remix",
          "bio": "Kent C. Dodds is a world renowned speaker, teacher, and trainer and he's actively involved in the open source community as a maintainer and contributor of hundreds of popular npm packages. Kent is a Co-Founder and Director of Developer Experience at Remix. He is the creator of EpicReact.Dev and TestingJavaScript.com. He's an instructor on egghead.io and Frontend Masters. He's also a Google Developer Expert. Kent is happily married and the father of four kids. He likes his family, code, JavaScript, and React.",
          "img": "/speakers/speaker-kent.jpg"
        }
      ]
    },
    {
      "name": "Serverless",
      "description": "Serverless is an architectural pattern for applications where you don't provision or maintain servers. At its core, you're leveraging other people's servers (such as AWS, Google Cloud, or Azure), and using cloud functions to run servers only when prompted or necessary. Typically you pay for your server uptime down to the millisecond, rather than running it constantly.",
      "img": "/about/topic-tables/serverless.svg",
      "managers": [
        {
          "name": "Brian Leroux",
          "title": "CTO",
          "company": "Begin.com",
          "bio": "Brian is the CTO and co-founder of Begin.com, a comprehensive framework for building and deploying serverless-first websites, applications, and APIs. He is the creator and maintainer of OpenJS Architect, an open-source framework for building and deploying serverless applications. He has been building with Deno since mid-2019. You can catch him @brianleroux on Twitter where he talks about JavaScript, Serverless, Deno, and other developer-related content. ",
          "img": "/speakers/speaker-brian.jpg"
        },
        {
          "name": "Swizec Teller",
          "title": "Software Engineer",
          "company": "Tia",
          "bio": "Swizec is a prolific engineer, instructor, blogger, streamer, conference speaker, and author. He's published many books and courses including React for DataViz, React + D3v4, Data Visualization with D3.js, the work-in-progress Serverless Handbook, and others. He maintains a Rails app pulling 20 requests per second, a serverless system doing a million requests per day, and wishes his side projects were just as popular.",
          "img": "/speakers/speaker-swizec.jpg"
        }
      ]
    },
    {
      "name": "GraphQL",
      "description": "GraphQL is changing the way we think about data in our apps. It's a query language for APIs and a runtime for fulfilling those queries with your existing data. It provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.",
      "img": "/about/topic-tables/graphql.svg",
      "managers": [
        {
          "name": "Sean Grove",
          "title": "Systems Architect",
          "company": "Netlify via OneGraph",
          "bio": "Co-founder of OneGraph (acquired by Netlify) - the easiest way to build integrations with 3rd-party services. Connect Stripe, Salesforce, Zendesk, Twitter, GitHub, and more through one consistent GraphQL interface.",
          "img": "/speakers/speaker-sean.jpg"
        },
        {
          "name": "Ben Awad",
          "title": "Founder",
          "company": "Saffron",
          "bio": "Ben is the founder of mysaffronapp.com — a platform to organize all your recipes into digital cookbooks. He creates educational videos on YouTube about GraphQL, React, Typescript, and more.",
          "img": "/speakers/speaker-ben-awad.jpg"
        }
      ]
    },
    {
      "name": "React Developer Tools",
      "description": "If you've ever built an app with React, chances are you've used React Developer Tools. It's a powerful & handy browser extension that allows you to inspect the React component hierarchies in the browser and record performance information. It's maintained by Brian Vaughn of the React team.",
      "img": "/about/topic-tables/devtools.svg",
      "managers": [
        {
          "name": "Brian Vaughn",
          "title": "Software Engineer",
          "company": "Replay",
          "bio": "Brian enjoys building tools that help make other engineers more productive. Before joining Replay, he spent the past several years building and maintaining the React JS developer tools as a member of the React core team. When he's not writing software, Brian also enjoys making music and running.",
          "img": "/speakers/speaker-brian.jpg"
        }
      ]
    },
    {
      "name": "React Router",
      "description": "Closing in on a decade of client-side routing, React Router v6 takes the best features from previous versions—and its sister project, Reach Router—in our smallest and most powerful package yet. Come chat with one of its' co-creators & maintainers, Ryan Florence!",
      "img": "/about/topic-tables/reactrouter.svg",
      "managers": [
        {
          "name": "Ryan Florence",
          "title": "Co-founder",
          "company": "Remix",
          "bio": "Ryan is the co-founder of Remix, co-creator of React Router, and co-founder of React Training.",
          "img": "/speakers/speaker-ryan.jpg"
        }
      ]
    },
    {
      "name": "Redux",
      "description": "Redux helps you write applications that behave consistently, run in different environments (client, server, and native), and are easy to test. Redux Toolkit is the official, opinionated, batteries-included toolset for efficient Redux development. Come and chat with the maintaner of Redux to learn more about Redux and what's next!",
      "img": "/about/topic-tables/redux.svg",
      "managers": [
        {
          "name": "Mark Erikson",
          "title": "Senior Software Engineer",
          "company": "Northrop Grumman",
          "bio": "Mark is a software engineer living in southwest Ohio, USA, where he patiently awaits the annual heartbreak from the Reds and the Bengals. Mark is a Redux maintainer, author of the Redux FAQ, maintains the React/Redux Links list and Redux Addons Catalog, tweets at @acemarke, and blogs at https://blog.isquaredsoftware.com. He can be usually found in the Reactiflux chat channels, answering questions about React and Redux.",
          "img": "/speakers/speaker-mark.jpg"
        }
      ]
    },
    {
      "name": "State Management",
      "description": "There are many career paths for the software engineer, and management is one of them. This position requires a different type of engineering, since people are not as predictable as code! Come chat with a few managers who have been doing this for some time.",
      "img": "/about/topic-tables/engineering-management.svg",
      "managers": [
        {
          "name": "David Khourshid",
          "title": "Engineering Manager",
          "company": "Netflix",
          "bio": "Ryan is a Software Engineering Manager at Netflix. He leads a team of cross-platform UI Engineers that build the signup flow for Netflix on iOS, Android, Website, and TV. He's also the Canadian voice on the Front End Happy Hour podcast. ",
          "img": "/speakers/speaker-ryan-burgess.jpg"
        },
        {
          "name": "Erik Rasmussen",
          "title": "Senior Frontend Engineer",
          "company": "Centered.app",
          "bio": "Erik is an American expat in Spain and author of Redux Form and React Final Form. He's currently obsessed with XState, Remix, and building the best productivity app for developers at Centered.",
          "img": "/speakers/speaker-erik.jpg"
        }
      ]
    }
  ]
}
