{
  "section": {
    "h2Slab": "Topic Tables",
    "p1": "A gathering place where engineers test & expand their knowledge of a subject through discussion, moderated by experts. Easily identify the subjects you want to discuss and learn about, & meet with friends old & new to make your conference experience even better.",
    "date": "May 3",
    "time": "7:30pm - 9:00pm",
    "bullets": [
      "Takes place following the opening keynote",
      "Easily identify the subjects you care about",
      "Break the ice with other attendees, speakers, and workshop instructors",
      "Engage in conversation or listen to others discuss",
      "Make new friends & improve your conference experience"
    ],
    "h3Slab": "Topics & Moderators coming soon"
  },
  "topics": [
    {
      "name": "Suspense",
      "description": "React 16.6 added a <Suspense> component that lets you “wait” for some code to load and declaratively specify a loading state (like a spinner) while we’re waiting. Suspense for Data Fetching is a new feature that lets you also use <Suspense> to declaratively “wait” for anything else, including data.",
      "img": "/about/topic-tables/suspense.svg",
      "managers": [
        {
          "name": "Kent C. Dodds",
          "title": "Software Engineer & Teacher",
          "company": "KentCDodds.com",
          "bio": "Kent C. Dodds is a world-renowned speaker, teacher, and trainer who is actively involved in the open source community as a maintainer and contributor of hundreds of popular npm packages. Kent is the creator of TestingJavaScript.com, and he's an instructor on egghead.io and Frontend Masters. He's also a Google Developer Expert. Kent is happily married and the father of four kids. He likes his family, code, JavaScript, and React.",
          "img": "/speakers/speaker-kent.jpg"
        },
        {
          "name": "Chantastic",
          "title": "Frontend Architect",
          "company": "Planning Center",
          "bio": "Chantastic is the host of the React Podcast and a frontend architect at Planning Center.",
          "img": "/speakers/speaker-chantastic.jpg"
        }
      ]
    },
    {
      "name": "Performance",
      "description": "A slow, under-performing website is not just a pain for your users -- it can seriously hurt your companies bottom line. Come chat and learn about web performance with Ken Wheeler!",
      "img": "/about/topic-tables/performance.svg",
      "managers": [
        {
          "name": "Ken Wheeler",
          "title": "Senior Dub-master",
          "company": "Internet",
          "bio": "Ken is an open-source developer and certified knucklehead.",
          "img": "/speakers/speaker-ken.jpg"
        }
      ]
    },
    {
      "name": "Typescript",
      "description": "TypeScript is a typed superset of JavaScript that compiles to plain JavaScript. It has become one of the more popular ways to write JavaScript and React apps, designed specficially to help developers scale and maintain large JavaScript applications.",
      "img": "/about/topic-tables/typescript.svg",
      "managers": [
        {
          "name": "Tejas Kumar",
          "title": "Head of Vetting",
          "company": "G2i",
          "bio": "Tejas has been working with TypeScript professionally for 3 years and has a number of open source projects available on GitHub and software projects in production written in TypeScript. He believes TypeScript creates software that is more stable and scalable, allowing developers to engineer software that is less prone to bugs, and more predictable during large refactors.",
          "img": "/speakers/speaker-tejas.jpg"
        },
        {
          "name": "Daria Caraway",
          "title": "Software Engineer",
          "company": "Workday",
          "bio": "Daria is a Speaker, Certified Scrum Master and Software Engineer at Workday where she builds consumer grade experiences for the enterprise user.",
          "img": "/speakers/speaker-daria.jpg"
        }
      ]
    },
    {
      "name": "Next.js",
      "description": "Next.js is a popular React framework for building server-rendered apps, static sites, progressive-web apps, and more. It is used in production by Netflix, GitHub, Docker, Twitch, Uber, and many others.",
      "img": "/about/topic-tables/next.svg",
      "managers": [
        {
          "name": "JJ Kasper",
          "title": "Software Engineer",
          "company": "Vercel",
          "bio": "I’m a Software Engineer at Vercel on the Next.js core team. I’m passionate about building great development and user experiences by leveraging open-source technology. I really enjoy getting to learn about the latest developments in tech and finding ways to apply these developments throughout my work.",
          "img": "/speakers/speaker-jj.jpg"
        },
        {
          "name": "Joe Haddad",
          "title": "Senior Software Engineer",
          "company": "Vercel",
          "bio": "Joe works full-time on Next.js as a Senior Software Engineer at Vercel. Prior to joining Vercel, he maintained Create React App for more than three years. Joe is driven to make development more approachable through tooling and its developer experience.",
          "img": "/speakers/speaker-joe.jpg"
        }
      ]
    },
    {
      "name": "Jamstack",
      "description": "The Jamstack is a method of building and deploying websites and apps serverlessly, with your website statically pre-rendered and served on a global CDN edge network. It leverages JavaSctipt, APIs, and microservices to add rich functionality. It helps to reduce complexity, increase scalability, and increase the performance and security of your webpage or app.",
      "img": "/about/topic-tables/jamstack.svg",
      "managers": [
        {
          "name": "Guillermo Rauch",
          "title": "Founder & CEO",
          "company": "Vercel",
          "bio": "Guillermo Rauch is the founder of Vercel, co-creator of Now and Next.js, and former CTO and co-founder of LearnBoost and Cloudup, acquired by Wordpress.com in 2013. His background and expertise is in the realtime web. He's the creator of socket.io, one of the most popular JavaScript projects on GitHub, with implementations in many different programming languages and frameworks (currently running the realtime backend of high profile apps like Microsoft Office online). He created the first MongoDB ORM for Node.JS, MongooseJS. Before that he was a core developer of the MooTools JavaScript framework. He's the author of 'Smashing Node.JS' published by Wiley in 2012, best-selling book about Node.JS on Amazon in multiple programming categories. He's spoken at dozens of conferences all around the world about JavaScript and the realtime web, such as O'Reilly OSCON, QCon and NDC. Originally from Argentina, he dropped out of high school and moved to the US to pursue his passions in the San Francisco startup world. He's passionate about open source as an education medium. He's a former mentor of an Open Source Engineering class organized and pioneered by Stanford, with students from Harvard, MIT, Carnegie Mellon, UPenn, Columbia and others.",
          "img": "/speakers/speaker-guillermo.jpg"
        },
        {
          "name": "Chris on Code",
          "title": "Web Community Manager",
          "company": "DigitalOcean via Scotch.io",
          "bio": "Chris on Code is the founder of Scotch.io, a popular web development tutorial site that was recently acquired by DigitalOcean. Chris is obsessed with finding the most efficient and practical ways to code. He understands that what really matters is making a great experience for users. This is why he is in love with JAMstack. Easier coding! Great product for users!",
          "img": "/speakers/speaker-chris.jpg"
        },
        {
          "name": "Phil Hawksworth",
          "title": "Developer Experience Engineer",
          "company": "Netlify",
          "bio": "Phil is Principal Developer Experience Engineer at Netlify. With a passion for browser technologies, and the empowering properties of the web, he loves seeking out ingenuity and simplicity, especially in places where over-engineering is common. After more than 20 years of building web applications for companies such as Google, Apple, Nike, R/GA, and The London Stock Exchange, Phil has worked to challenge traditional technical architectures in favour of simplicity and effectiveness. Phil is also co-author of “Modern Web Development on the JAMstack” (O’Reilly, 2019)",
          "img": "/speakers/speaker-phil.jpg"
        }
      ]
    },
    {
      "name": "Testing",
      "description": "There are many ways of testing your app -- and many arguments for how much testing is necessary. Come chat at the Testing table if you're interested in test automation, improving the testing at your company, or you're just curious about the different ways to test React components and apps.",
      "img": "/about/topic-tables/testing.svg",
      "managers": [
        {
          "name": "Muhsin Abdul-Musawwir",
          "title": "Software Engineer",
          "company": "Slack",
          "bio": "Muhsin 'Moose' Abdul-Musawwir is a software engineer at Slack, where he is currently leading an organization-wide initiative to improve their test automation coverage. He is a mentor at Node School and a former lead instructor at Telegraph Academy's preparatory course. He enjoys DIYing, teaching/training, Capoeira, and overnight hacking.",
          "img": "/speakers/speaker-moose.jpg"
        },
        {
          "name": "Alex Krolick",
          "title": "Software Engineer",
          "company": "Box",
          "bio": "Alex is a React Testing Library maintainer and a software engineer at Box, Inc.",
          "img": "/speakers/speaker-alex.jpg"
        }
      ]
    },
    {
      "name": "Web Media",
      "description": "Web media such as images, video, and audio are crucial parts of today's websites and applications. But they are often the biggest bottleneck on performance. Come chat with experts to learn about the technical issues at the root of this, what solutions are presently at your disposal, and what the future holds for media on the web.",
      "img": "/about/topic-tables/web-media.svg",
      "managers": [
        {
          "name": "Matt McClure",
          "title": "Co-founder",
          "company": "Mux",
          "bio": "Matthew is an internet video nerd. He's the co-founder and Head of Technology & Community at Mux, a startup building online video infrastructure for developers, a core-contributor to Video.js, the biggest open source HTML5 video framework, and the organizer of Demuxed, the largest video-focused dev conference/community in the world.",
          "img": "/speakers/speaker-matt.jpg"
        }
      ]
    },
    {
      "name": "From Junior to Senior Engineer",
      "description": "If you're a junior engineer, the path to senior may seem simple. Get better at coding, right? But that's just the start of it. In this topic table, AWS engineer Shawn Swyx Wang will chat & answer your questions about moving up in your career to senior engineer!",
      "img": "/about/topic-tables/junior-to-senior.svg",
      "managers": [
        {
          "name": "Shawn Swyx Wang",
          "title": "Senior Developer Advocate",
          "company": "AWS",
          "bio": "Swyx is an Infinite Builder and Senior Developer Advocate at AWS. He's the author of the Coding Career Handbook. In his free time he helps people Learn in Public at Egghead.io.",
          "img": "/speakers/speaker-swyx.jpg"
        }
      ]
    },
    {
      "name": "Data Visualizations",
      "description": "The graphic representation of data helps us make sense of our data, and communicate data more effectively to our users. There are many libraries and tools that empower frontend React developers. Come and chat about these tools and patterns with experts in data visualization.",
      "img": "/about/topic-tables/data-viz.svg",
      "managers": [
        {
          "name": "Jana Beck",
          "title": "Data Visualization Engineer",
          "company": "Stitch Fix",
          "bio": "Jana took the long road to web development with a significant delay as a Ph.D. candidate in linguistics doing a lot of scientific computing in Python. Today she works as a front end engineer supporting data scientists at Stitch Fix. When she's not coding or sleeping, there's a high probability that Jana is sweating in a dance studio or a gym.",
          "img": "/speakers/speaker-jana.jpg"
        }
      ]
    },
    {
      "name": "Serverless",
      "description": "Serverless is an architectural pattern for applications where you don't provision or maintain servers. At its core, you're leveraging other people's servers (such as AWS, Google Cloud, or Azure), and using cloud functions to run servers only when prompted or necessary. Typically you pay for your server uptime down to the millisecond, rather than running it constantly.",
      "img": "/about/topic-tables/serverless.svg",
      "managers": [
        {
          "name": "Brian Leroux",
          "title": "CTO",
          "company": "Begin.com",
          "bio": "Brian is the CTO and co-founder of Begin.com, a comprehensive framework for building and deploying serverless-first websites, applications, and APIs. He is the creator and maintainer of OpenJS Architect, an open-source framework for building and deploying serverless applications. He has been building with Deno since mid-2019. You can catch him @brianleroux on Twitter where he talks about JavaScript, Serverless, Deno, and other developer-related content. ",
          "img": "/speakers/speaker-brian.jpg"
        },
        {
          "name": "Swizec Teller",
          "title": "Software Engineer",
          "company": "Tia",
          "bio": "Swizec is a prolific engineer, instructor, blogger, streamer, conference speaker, and author. He's published many books and courses including React for DataViz, React + D3v4, Data Visualization with D3.js, the work-in-progress Serverless Handbook, and others. He maintains a Rails app pulling 20 requests per second, a serverless system doing a million requests per day, and wishes his side projects were just as popular.",
          "img": "/speakers/speaker-swizec.jpg"
        }
      ]
    },
    {
      "name": "GraphQL",
      "description": "GraphQL is changing the way we think about data in our apps. It's a query language for APIs and a runtime for fulfilling those queries with your existing data. It provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.",
      "img": "/about/topic-tables/graphql.svg",
      "managers": [
        {
          "name": "Lee Byron",
          "title": "Software Engineer",
          "company": "Robinhood",
          "bio": "Lee is the co-creator and maintainer of GraphQL. He recently left Facebook after nearly 10 years to help lead web engineering at Robinhood, a free and simple investing platform. Lee has been instrumental in creating many of the most popular open source libraries used by millions of developers worldwide including React, Immutable.js, Yarn, Prettier, Flow, and others.",
          "img": "/speakers/speaker-lee.jpg"
        },
        {
          "name": "Eve Porcello",
          "title": "Technical Instructor",
          "company": "Moon Highway",
          "bio": "Eve Porcello is a software engineer and instructor at Moon Highway, a curriculum development and training company in Northern California. She has created courses for LinkedIn Learning and egghead.io and is the co-author of O’Reilly’s Learning React and Learning GraphQL.",
          "img": "/speakers/speaker-eve.jpg"
        },
        {
          "name": "Tanmai Gopal",
          "title": "Co-founder",
          "company": "Hasura",
          "bio": "Tanmai Gopal is the CEO and co-founder of Hasura. He is a StackOverflow-powered fullstack developer whose areas of interest and work span React, GraphQL, nodejs, haskell, docker, postgres & kubernetes. He is passionate about making it easy to build complex things and is the instructor of India's largest MOOC imad.tech with over 250,000 students.",
          "img": "/speakers/speaker-tanmai.jpg"
        },
        {
          "name": "Ben Awad",
          "title": "Founder",
          "company": "Saffron",
          "bio": "Ben is the founder of mysaffronapp.com — a platform to organize all your recipes into digital cookbooks. He creates educational videos on YouTube about GraphQL, React, Typescript, and more.",
          "img": "/speakers/speaker-ben-awad.jpg"
        }
      ]
    },
    {
      "name": "RxJS",
      "description": "RxJS is a library for composing asynchronous and event-based programs by using observable sequences. It provides one core type, the Observable, satellite types (Observer, Schedulers, Subjects) and operators inspired by Array#extras (map, filter, reduce, every, etc) to allow handling asynchronous events as collections.",
      "img": "/about/topic-tables/rxjs.svg",
      "managers": [
        {
          "name": "Ben Lesh",
          "title": "Senior Software Engineer",
          "company": "Citadel Securities",
          "bio": "Ben Lesh is the lead author and development lead of RxJS. He was previously on the Angular core team at Google and Netflix, where he rewrote RxJS for better performance and JavaScript future specification compliance. Ben is also the co-author of redux-observable and has contributed to various open source projects. In his free time he is a Co-Founder at This Dot Labs and Co-Founder of RxWorkshop.",
          "img": "/speakers/speaker-benl.jpg"
        }
      ]
    },
    {
      "name": "Internationalization",
      "description": "Creating a website or app for the world is hard. Not only are you dealing with different languages, but also left-to-right text and formatting vs. right-to-left text, different cultural standards, and more. As billions of more people in the world come online, this process is not just an accessibility issue, but also a strong business incentive.",
      "img": "/about/topic-tables/i18n.svg",
      "managers": [
        {
          "name": "Naomi Meyer",
          "title": "Software Engineer",
          "company": "Adobe",
          "bio": "Naomi works as a Software Development Engineer at Adobe in New York City, where she is the product champion for internationalization (i18n) on her team. Before writing JavaScript full time, Naomi worked teaching English as a foreign language in local classrooms across Asia and West Africa. She is passionate about developing with diversity, inclusion, and internationalization (i18n) in mind, and enjoys hiking and riding bikes on the weekends.",
          "img": "/speakers/speaker-naomi.jpg"
        }
      ]
    },
    {
      "name": "Redux",
      "description": "Redux helps you write applications that behave consistently, run in different environments (client, server, and native), and are easy to test. Redux Toolkit is the official, opinionated, batteries-included toolset for efficient Redux development. Come and chat with the maintaner of Redux to learn more about Redux and what's next!",
      "img": "/about/topic-tables/redux.svg",
      "managers": [
        {
          "name": "Mark Erikson",
          "title": "Senior Software Engineer",
          "company": "Northrop Grumman",
          "bio": "Mark is a software engineer living in southwest Ohio, USA, where he patiently awaits the annual heartbreak from the Reds and the Bengals. Mark is a Redux maintainer, author of the Redux FAQ, maintains the React/Redux Links list and Redux Addons Catalog, tweets at @acemarke, and blogs at http://blog.isquaredsoftware.com. He can be usually found in the Reactiflux chat channels, answering questions about React and Redux.",
          "img": "/speakers/speaker-mark.jpg"
        }
      ]
    },
    {
      "name": "Blitz",
      "description": "Blitz.js is a full-stack React framework inspired by Ruby on Rails. Come and chat with its creator and maintainer, Brandon Bayer, and learn how it can help you on your next project!",
      "img": "/about/topic-tables/blitz.svg",
      "managers": [
        {
          "name": "Brandon Bayer",
          "title": "Open Source Developer",
          "company": "Blitz.js",
          "bio": "Brandon Bayer is the creator of Blitz.js. He is currently a full-time maintainer of Blitz. Outside of Blitz, his other passion is flying real airplanes and RC helicopters.",
          "img": "/speakers/speaker-brandon.jpg"
        }
      ]
    },
    {
      "name": "Engineering Management",
      "description": "There are many career paths for the software engineer, and management is one of them. This position requires a different type of engineering, since people are not as predictable as code! Come chat with a few managers who have been doing this for some time.",
      "img": "/about/topic-tables/engineering-management.svg",
      "managers": [
        {
          "name": "Ryan Burgess",
          "title": "Engineering Manager",
          "company": "Netflix",
          "bio": "Ryan is a Software Engineering Manager at Netflix. He leads a team of cross-platform UI Engineers that build the signup flow for Netflix on iOS, Android, Website, and TV. He's also the Canadian voice on the Front End Happy Hour podcast. ",
          "img": "/speakers/speaker-ryan-burgess.jpg"
        },
        {
          "name": "Jonathan Cutrell",
          "title": "Engineering Manager",
          "company": "PBS",
          "bio": "Jonathan Cutrell is a self-taught engineer turned engineering manager based in Chattanooga, Tennessee. In his early career, Jonathan helped build and manage a team of engineers at Whiteboard, a digital agency where he eventually served as CTO. Jonathan went on to contribute as an engineer at Clearbit and then as an engineering manager at Tesorio. Now, Jonathan manages engineers for a fast-growing team at PBS. Jonathan is the creator and host of the top-100 tech podcast Developer Tea and co-founder of Spec.fm, a network of podcasts for designers and developers. Jonathan lives with his wife, Lauren, children Liam and Nova, and dog Evie.",
          "img": "/speakers/speaker-jonathan.jpg"
        },
        {
          "name": "Pete Hunt",
          "title": "Senior Engineering Manager",
          "company": "Twitter",
          "bio": "Pete Hunt is an engineering manager at Twitter. He's a former member of the React core team at Facebook and delivered the quintessential talk at React Conf EU 2013 that helped to educate the world on the patterns and purpose of the React architecture.",
          "img": "/speakers/speaker-pete.jpg"
        }
      ]
    }
  ]
}
